[
  {
    "arabicName": "الله",
    "name": "Allah",
    "shortDescription": "Bütün isimlerin hususiyetlerini kendinde toplayan en kapsamlı özel ad.",
    "shortDescriptionEn" : "The most comprehensive proper name that combines the characteristics of all names.",
    "longDescription": "Gördüğümüz görmediğimiz, bildiğimiz bilmediğimiz bütün âlemlerin sâhibi ve mâliki, kâinatın yegâne yaratıcısı, her türlü övgüye ve ibâdete lâyık olan yüceler yücesi Rabbimizin doksan dokuz isminin bütün hususiyetlerini kendinde toplayan en kapsamlı özel adıdır.",
    "longDescriptionEn" : "It is the most comprehensive and personal name that gathers in itself all the characteristics of the ninety-nine names of our Almighty Lord, the owner and possessor of all the worlds, the ones we see and the ones we do not see, the ones we know and the ones we do not know, the sole Creator of the universe, worthy of all praise and worship."
  },
  {
    "arabicName": "الرحمن",
    "name": "Er-Rahmân",
    "shortDescription": "He is merciful and compassionate.",
    "shortDescriptionEn": "",
    "longDescription": "Rahmet ve merhamet; acıma, bağışlama, kalp yufkalığı, şefkat ve ihsân anlamlarına gelir. 'Rahmân' ve 'Rahîm' isimleri, 'çok şefkat ve merhamet eden' anlamındadır. Kur’ân’da 'Rahmân' ismi elli yedi, 'Rahîm' ismi yüz on beş defa Allah’a nisbet edilmektedir. 'Rahmân', Allah’ın zâtî ismi, 'Rahîm' ise fiilî isimlerindendir. 'Rahmân', zâtî ismi olduğundan Allah’tan başkasına isim olarak verilemez. Fiilî isimlerinden olan 'Rahîm' ise başkasına isim olarak verilebilir. Allah’ın bu ismi bir kulda tecelli ederse, o kul merhamet kanatlarını bütün yaratıklara açar. Allah’ın rahmeti bütün yaratılmışları kapsar. Rahmetiyle, inanan inanmayan bütün insanlara rızıklarını ve nimetlerini bol bol vermektedir. Hz. Peygamber Allah’ın rahmetini şöyle anlatır: 'Şüphesiz Allah’ın yüz rahmeti vardır. Bunlardan bir tanesini yaratıklarına vermiştir. Yaratıkların birbirlerine acımaları bu rahmet sebebiyledir. Allah’ın rahmetinin doksan dokuzu kıyâmet günü içindir.'",
    "longDescriptionEn": "Mercy and compassion mean pity, forgiveness, tenderness of heart, compassion and kindness. The names 'Rahman' and 'Rahim' mean 'the most compassionate and merciful'. In the Quran, the name 'Rahman' is attributed to Allah fifty-seven times and the name 'Rahim' one hundred and fifteen times. 'Rahman' is the personal name of Allah, while 'Rahim' is one of His physical names. Since 'Rahman' is a personal name, it cannot be given as a name to anyone other than Allah. 'Rahim', which is one of His physical names, can be given as a name to someone else. If this name of Allah manifests itself in a servant, that servant spreads his wings of mercy to all creatures. Allah's mercy encompasses all creatures. With His mercy, He abundantly provides sustenance and blessings to all people, whether they believe or not. The Prophet (pbuh) describes Allah's mercy as follows: \"Surely Allah has a hundred mercies. He has given one of them to His creatures. It is because of this mercy that the creatures show mercy to each other. Ninety-nine of Allah's mercy is for the Day of Resurrection."
  },
  {
    "arabicName": "الرحيم",
    "name": "Er-Rahim",
    "shortDescription": "Merhamet eden, bağışlayan.",
    "shortDescriptionEn": "Merciful, forgiving.",
    "longDescription": "Pek çok merhamet edici, verdiği nimetleri iyi kullananları daha büyük nimetler vermek suretiyle mükâfâtlandırıcı anlamındadır. Rahmân ve rahîm, rahmet kökünden türemiştir. İkisi de Allah’ın engin merhamet ve şefkatini bildirir. Ancak aralarında şöyle bir fark vardır: Rahmân ismi dünyada mü’min kâfir herkesi kuşatmışken, rahîm, sadece inananlara mahsustur. Bu bakımdan Allah, âhirette sadece mü’minlere rahmet ederek, onları cennetine koyacaktır.Rahmân ve rahîm isimleri iki türlü rahmet ifâde eder. Rahmân isminin ifâde ettiği rahmet, hiç bir şarta, kesbe ve irâdeye bağlı olmayarak bahşolunan rahmettir. Bu bütün yaratıkları kapsayan bir rahmettir. Bunda çalışan çalışmayan, itaatli suçlu, inançlı inançsız ayırımı yoktur. Rahîm isminin ifâde ettiği rahmet ise, Rahmân’ın lütfu olan rahmeti iyiye kullanarak çalışanlara bir mükâfât olmak üzere verilen rahmettir. Bu, en az bire ondur. Çalışanın samimiyetine göre yedi yüz katına ve hatta daha fazla katlara çıkabilir. Elbette çalışanla çalışmayan bir olmaz.",
    "longDescriptionEn": "Many merciful people have the meaning of rewarding those who use their blessings well by giving them greater blessings. Rahman and Rahim are derived from the root of mercy. Both of them express Allah's vast mercy and compassion. However, there is a difference between them: While the name Rahman encompasses everyone in this world, both believers and unbelievers, Rahim is specific to believers only. In this respect, Allah will show mercy only to believers in the hereafter and will admit them to Paradise. The names Rahman and Rahim express two types of mercy. The mercy expressed by the name Rahman is mercy granted without any condition, acquisition or will. This is a mercy that encompasses all creatures. There is no distinction between the working and the non-working, the obedient and the guilty, the believer and the unbeliever. The mercy expressed by the name Rahim is the mercy of the Rahman, who uses his grace for good. It is a mercy given to those who work as a reward. It is at least one to ten. Depending on the sincerity of the worker, it can be seven hundred times or even more. Of course, the one who works is not the same as the one who does not work."
  },
  {
    "arabicName": "الملك",
    "name": "El-Melik",
    "shortDescription": "Mülkün gerçek sahibi, mülk ve saltanatı devamlı olan.",
    "shortDescriptionEn": "The real owner of the property, whose property and reign are continuous.",
    "longDescription": "Görülen ve görülmeyen bütün âlemlerin, bütün kâinatın tek sahibi ve mutlak surette tek hükümdârı demektir. Kendisine ibâdet edilmeye yegâne lâyık olan O’dur. O’nun istediği olur, istemediği olmaz. O, bir şeyin olmasını isterse, sadece 'ol' der, o da derhal olur. Olmasını istemediği hiçbir şey de asla varlık sahasına çıkamaz. Bütün evren, yaratılmış olan her şey, mükemmel bir düzen içerisinde işlemektedir. Asla bir başı boşluk ve düzensizlik yoktur. Bütün idâre tek bir yerden geliyor. O Allah, dünya ve âhiret hayatındaki her şeye gerçek anlamda ve kayıtsız şartsız hâkim ve mâlik olan ve dilediği gibi tasarrufta bulunandır.",
    "longDescriptionEn": "It means the sole owner and absolute ruler of all the seen and unseen worlds, of the entire universe. He is the only one worthy of being worshipped. What He wills happens and what He does not will not happen. If He wants something to happen, He simply says 'be' and it happens immediately. Nothing that He does not want to happen can ever come into being. The entire universe, everything that has been created, functions in perfect order. There is never any disorder or disorder. All administration comes from a single source. He is Allah, the one who truly and unconditionally dominates and owns everything in this world and the life of the hereafter and who disposes of it as He wishes."
  },
  {
    "arabicName": "القدوس",
    "name": "El-Kuddûs",
    "shortDescription": "Her türlü eksiklik ve ayıplardan münezzeh olan.",
    "shortDescriptionEn": "Pure from all kinds of deficiencies and faults.",
    "longDescription": "Hatadan, gafletten, âcizlikten, her türlü eksiklikten uzak, bütün kemâl sıfatları üzerinde toplamış, bütün övgülerin üstünde olan demektir.Her türlü ayıptan, kusurdan ve ihtiyaçtan uzak olan, her türlü hayır ve bereketin kaynağı olan mübarek zât demektir. Her türlü eksiklikten, lekeden, pastan, kirden son derece temiz demektir. Gördüğümüz görmediğimiz, bildiğimiz bilmediğimiz her şeyi yaratan Allah Teâlâ, kâinâtı akıllara durgunluk verecek bir düzen ile yaratmıştır.",
    "longDescriptionEn": "It means the one who is free from error, heedlessness, helplessness and all kinds of deficiencies, who has gathered all the attributes of perfection and is above all praise. It means the blessed one who is free from all kinds of shame, flaw and need, who is the source of all kinds of goodness and abundance. It means extremely clean from all kinds of deficiencies, stains, rust and dirt. Allah Almighty, who created everything we see and everything we do not see, everything we know and everything we do not know, has created the universe with an order that will boggle the mind."
  },
  {
    "arabicName": "السلام",
    "name": "Es-Selâm",
    "shortDescription": "Kullarını selâmete çıkaran.",
    "shortDescriptionEn": "He who brings His servants to salvation.",
    "longDescription": "Her türlü eksiklikten, ayıptan, kusurdan, yaratılmışlara özgü değişim ve yok oluştan münezzeh ve sâlim olan; kullarını her türlü kötülüklerden, tehlikelerden selâmete çıkaran; Cennetteki kullarına selam veren demektir. Allah, gerek dünyada, gerekse âhirette tehlikeye düşen kullarını tehlikelerden kurtarıp selamete çıkarandır. Hz. Peygamber, her namazdan sonra; “Allah’ım! Sen’sin selâm ve Sen’dendir selâm!” buyurmuştur. Selâm, Esmâ-i Hüsnâ’dan biri olduğu için Müslüman olmayanlara bu lafızla selam verilmez. Müslüman olmayanlar, dua ve esenlik dileği olan “selâm”ı hak etmemişlerdir.",
    "longDescriptionEn": "It means the one who is pure and sound from all kinds of deficiencies, faults, flaws, and the change and destruction peculiar to creatures; the one who saves His servants from all kinds of evil and danger; and the one who greets His servants in Paradise. Allah is the One who saves His servants who are in danger both in this world and in the hereafter from dangers and brings them to safety. The Prophet (pbuh) said after every prayer, 'O Allah! It is You who sends the peace and salvation from You!' Since salam is one of the Most Beautiful Names, non-Muslims are not greeted with this word. Non-Muslims do not deserve the 'salam', which is a prayer and wish for well-being."
  },
  {
    "arabicName": "المؤمن",
    "name": "El-Mü’min",
    "shortDescription": "Gönüllerde iman ışığı uyandıran.",
    "longDescription": "Güven veren, va’dine güvenilen; inananları korku ve endişeden güvende kılan; mü’minlerin îmân ve samimiyetini tasdik eden; mûcizeler vermek suretiyle Peygamberlerinin doğruluğunu isbatlayan; kendisine sığınanları koruyan, emniyetle rahatlandıran demektir.Allah’ın kullarına en büyük nimetlerinden biri, îmândır. Diğeri, emniyettir. İnsan; canı, malı, ırzı, namusu için her zaman bir endişe ve korku içinde kalsaydı, bu ne büyük bir azap olurdu. Bu isim bir kulda tecellî edince, o kulun kalbine imân iyice yerleşir. O, güvenilir biri olur. Allah Teâlâ, mü’min isminin bir tecellisi olarak inananları korkulardan güvende kılıyor.",
    "shortDescriptionEn": "The one who awakens the light of faith in hearts.",
    "longDescriptionEn": "The one who grants security, trusted in His promises; the one who keeps believers safe from fear and anxiety; the one who affirms the faith and sincerity of the believers; the one who proves the truth of His Prophets through miracles; the one who protects and provides security to those who seek refuge with Him. One of the greatest blessings Allah grants to His servants is faith, and the other is security. If a person were to live in constant fear for their life, wealth, honor, and reputation, it would be a great torment. When this name manifests in a servant, faith becomes deeply rooted in their heart. They become a trustworthy person. Allah, by manifesting the name of 'Al-Mu’min', ensures the safety of the believers from all fears."
  },
  {
    "arabicName": "المهيمن",
    "name": "El-Müheymin",
    "shortDescription": "Her şeyi gözetleyip kontrol eden.",
    "longDescription": "Kâinatın bütün işlerini gözetleyip yöneten; bütün yaratıklarını gözetip koruyan; korkulardan emin kılan demektir. Yine kullarına asla zulmetmeyen; her söylediği ve yaptığına güvenilen; bütün kullarını hükmü altına alan; olup biten her şeyden haberdâr olan ve Peygamberi’ne indirdiği vahyin doğruluğuna tanıklık eden; kullarını dâimâ gözetim altında bulunduran; mü’minlere güven, sevgi ve huzur veren demektir.",
    "shortDescriptionEn": "The one who watches over and controls everything.",
    "longDescriptionEn": "The one who oversees and manages all the affairs of the universe; the one who watches over and protects all His creatures; the one who grants safety from fears. He is the one who never wrongs His servants; the one whose words and actions are always trusted; the one who has authority over all His servants; the one who is aware of everything that happens and bears witness to the truth of the revelation He sent to His Prophet; the one who always keeps His servants under His surveillance; the one who grants security, love, and peace to the believers."
  },
  {
    "arabicName": "العزيز",
    "name": "El-Aziz",
    "shortDescription": "Mağlup edilmesi asla mümkün olmayan.",
    "longDescription": "Yenilmesi mümkün olmayan gâlip; dengi ve benzeri bulunmayacak şekilde değerli ve şerefli; güçlü ve yenilmez demektir. Allah Teâlâ yegâne güç ve kuvvet sahibi olan mutlak gâliptir. O’nu âciz bırakacak hiç bir güç yoktur. Dilediğini izzetli, şerefli ve üstün kılar.",
    "shortDescriptionEn": "The one who is impossible to defeat.",
    "longDescriptionEn": "The invincible and undefeated one; the one who is unmatched in value and honor; the strong and indomitable one. Allah is the absolute and unmatched force, the invincible one. No power can make Him weak. He elevates whom He wills in honor, dignity, and superiority."
  },
  {
    "arabicName": "الجبار",
    "name": "El-Cebbâr",
    "shortDescription": "İstediğini mutlak yapan, dilediğine muktedir olan.",
    "longDescription": "Dilediğini her durumda gerçekleştiren; istediğini zorla yaptırmaya muktedir olan; yaratılmışların halini iyileştiren; parçalanmış, dağılmış ve bozulmuş olanı düzeltip onaran; her şeyi tasarrufu altına alan demektir. Allah Teâlâ, kırılanları onarır, eksikleri tamamlar, her türlü perişanlıkları düzeltir, yoluna koyar. Düzeni bozulan her şeyi düzene koyar. Yaratıklarının ihtiyaçlarını giderir. Yaşama ve rızık sebeplerini sağlar. Kırılan ümitlerin canlanması, şaşırtıcı perişanlıkların iyi hale gelmesi ve yola konması için tek başvuru kaynağının Allah Teâlâ olduğunu bilmeli, yanlış yerlere başvurmamalıdır.",
    "shortDescriptionEn": "The one who absolutely makes whatever He wills happen.",
    "longDescriptionEn": "The one who accomplishes whatever He wills in any circumstance; the one who can force what He desires to happen; the one who improves the state of His creations; the one who fixes and repairs what is broken, scattered, or corrupted; the one who has control over everything. Allah repairs the broken, completes the incomplete, sets right all chaos, and restores order. He provides the needs of His creatures and ensures the means for life and sustenance. One should know that Allah is the only source to restore broken hopes, turn around distressing situations, and guide them to the right path, and should not seek help in the wrong places."
  }, {
  "arabicName": "المتكبر",
  "name": "El-Mütekebbir",
  "shortDescription": "Her şeyde büyüklüğünü gösteren.",
  "longDescription": "Her zaman ve her yerde büyüklüğünü gösteren; zât ve sıfatlarının mâhiyeti bilinemeyecek kadar ulu, yaratılmışların sıfatlarından yüce olan; azgın ve zâlim insanları mutlak gücüne boyun eğmek zorunda bırakan demektir. Büyüklük ve yücelik, ancak Allah’a mahsustur. İnsan çalışıp çabalamalı büyük adam olmalı, ama asla büyüklenmemelidir. Yaratılmışlar içinde ilk defa kendini büyük gören İblis olmuş ve bu durum onun lanetlenmesine, cehenneme girmesine sebep olmuştur.",
  "shortDescriptionEn": "The one who shows His greatness in everything.",
  "longDescriptionEn": "The one who displays His greatness at all times and in all places; the one whose essence and attributes are so exalted that they cannot be comprehended; the one who causes arrogant and tyrannical people to submit to His absolute power. Greatness and exaltation belong only to Allah. A person should strive to be great, but never be arrogant. The first creation to view itself as great was Iblis, and this led to his curse and his entry into Hell."
  },
  {
    "arabicName": "الخالق",
    "name": "El-Hâlık",
    "shortDescription": "Her şeyi yoktan var eden, yaratan.",
    "longDescription": "Her şeyi yaratan, yoktan var eden demektir. Allah Teâlâ, eşyayı, her hangi bir örneği ve benzeri olmadan yaratandır. Yarattığı her şeyi bütün ayrıntılarıyla bilir. Her şeyin varlığını, varlığı boyunca görüp geçireceği halleri bilir, olayları tayin ve tesbit eder, ona göre yaratır. Demek ki hâlık isminin iki anlamı vardır: birincisi; bir şeyin nasıl olacağını tayin ve tesbit etmek, ikincisi, o takdire uygun olarak o şeyi yaratmak, var etmek. Allah Teâlâ, her şeyi ezelde takdir etmiş, takdir ettiklerinin zamanı gelince bunları yaratmış, varlık sahasına çıkarmıştır. O’nun ilim, irâde, takdir ve yaratmasından hiç bir şey uzak kalamaz.",
    "shortDescriptionEn": "The one who creates everything from nothing.",
    "longDescriptionEn": "The one who creates everything and brings it into existence from nothing. Allah is the creator of all things, without any model or similarity. He knows every detail of what He creates. He knows the existence of all things and the states they will go through in their existence, and He creates according to His divine will. The name 'Al-Hâlik' has two meanings: first, to determine and designate how something will be, and second, to create and bring that thing into existence according to His determination. Allah has predestined everything in eternity and, when the time comes, He brings them into existence. Nothing escapes His knowledge, will, determination, and creation."
  },
  {
    "arabicName": "البارئ",
    "name": "El-Bârî",
    "shortDescription": "Her şeyi uygun bir tarzda ve birbirine uygun yaratan.",
    "longDescription": "Bir örneği ve maddesi olmaksızın yaratan; evrenin bütün parçalarını âhenkli ve düzenli olarak meydana getiren demektir. Allah Teâlâ, zât ve sıfatları bakımından yaratılmışlara asla benzemez. Yarattığı her şeyi hiç bir modele bağlı kalmaksızın yarattığı gibi, tam bir uygunluk ve kusursuzluk halinde yaratmıştır. Bir kulda bu isim tecellî edince, o kul yaptığı her şeyi adâletle, hakkâniyetle ve sağlam yapar.",
    "shortDescriptionEn": "The one who creates everything in a harmonious and fitting manner.",
    "longDescriptionEn": "The one who creates without any prior example or matter; the one who forms all the parts of the universe in harmony and order. Allah is incomparable in His essence and attributes to any of His creations. Just as He creates everything without following any model, He creates them in complete harmony and perfection. When this name manifests in a servant, they perform everything with justice, fairness, and integrity."
  },
  {
    "arabicName": "المصور",
    "name": "El-Musavvir",
    "shortDescription": "Her şeye bir şekil ve hususiyet verip tasvir eden.",
    "longDescription": "Varlıkları çeşitli şekillerde yaratan; yarattığı her varlığa ayrı bir şekil ve husûsiyet veren demektir. Hâlik, bâri’ ve musavvir isimlerinin üçü de yaratıcı anlamındadır. Bunlardan hâlik; bir örneği, eşi, benzeri olmaksızın ilk defa yaratan demektir. Bâri’; yarattığı şeyi düzgün yaratan, yarattığı canlıları, organları yerli yerinde, uyumlu yaratan demektir. Musavvir de; yarattığı her şeye ayrı bir şekil, biçim ve husûsiyet veren demektir. Yeryüzünde bulunan milyarlarca insanın her bir organının bir diğerine benzemeyişi, Allah’ın yaratıcılığının mükemmelliğine delildir. Bu isimden nasip alan kullar, Allah’ın yarattığı her şeye hayranlıkla ve ibretle bakarlar.",
    "shortDescriptionEn": "The one who gives form and characteristics to everything.",
    "longDescriptionEn": "The one who creates beings in various forms; the one who gives each created being a unique shape and characteristic. The names Hâlik, Bâri’, and Musavvir all refer to aspects of creation. Hâlik means the one who creates without any example or similarity; Bâri’ refers to the one who creates in a well-formed, harmonious way; and Musavvir is the one who gives distinct form and characteristics to every created thing. The uniqueness of every human being’s organ on Earth, from the billions of people, is proof of Allah’s perfect creativity. Those who are blessed with this name look upon Allah's creations with admiration and reflection."
  },
  {
    "arabicName": "الغفار",
    "name": "El-Gaffâr",
    "shortDescription": "Kullarının günahlarını örten, günahlarını bağışlayan.",
    "longDescription": "Dâimâ affeden; kullarının günahlarını örten, ayıp ve kusurlarını bağışlayan; tekrarlanan günahları bağışlayan; mağfireti, bağışlaması sonsuz olan demektir. Mânevî kirlerden, günahlardan temizlenmek için Allah Teâlâ’ya istiğfar etmeli, mağfiret ve bağışlanma dilemeliyiz.",
    "shortDescriptionEn": "The one who covers the sins of His servants and forgives them.",
    "longDescriptionEn": "The one who is always forgiving; the one who covers His servants' sins, excuses their faults, and forgives repeated sins. His forgiveness and mercy are infinite. To cleanse ourselves from spiritual impurities and sins, we should seek forgiveness from Allah and ask for His mercy and pardon."
  }, {
  "arabicName": "القهار",
  "name": "El-Kahhâr",
  "shortDescription": "Her şeye, her istediğini yapacak surette galip ve hakim olan.",
  "longDescription": "Yenilmeyen, yegane gâlip demektir. Allah Teâlâ, her şeye, her istediğini yapacak şekilde gâlip ve hâkimdir. Kuvvet ve kudretiyle her şeyi içinden ve dışından kuşatmıştır. O’na karşı her şeyin boynu büküktür. Dilediğini istediği anda yok ve helak eder.",
  "shortDescriptionEn": "The one who is dominant and governs everything in any way He desires.",
  "longDescriptionEn": "The invincible, the ultimate conqueror. Allah is dominant and sovereign over everything, in whatever way He wills. His power and authority encompass everything from within and outside. Everything is humbled before Him. He annihilates and destroys whatever He wills, at any moment."
},
  {
    "arabicName": "الوهاب",
    "name": "El-Vehhâb",
    "shortDescription": "Karşılık beklemeden bol bol veren; hibesi ve lütfu çok olan demektir.",
    "longDescription": "Karşılık beklemeden bol bol veren; hibesi ve lütfu çok olan demektir. Allah Teâlâ, bağışı çok olandır, karşılıksız verendir, nimetlerinin ardı arkası kesilmeyendir. İnanan inanmayan ayırımı yapmaksızın bütün kullarına nimetlerini bol bol verendir. Rahmeti gereği lütfu bol olan ve hayırlı işlerde başarıya ulaştırandır.",
    "shortDescriptionEn": "The one who gives abundantly without expecting anything in return.",
    "longDescriptionEn": "The one who gives freely and abundantly, without expecting anything in return. Allah is the one with vast generosity, the one who gives without condition, and whose blessings are endless. He gives His gifts generously to all His servants, regardless of belief. His mercy is immense, and He helps those who strive in righteous deeds to succeed."
  },
  {
    "arabicName": "الرزاق",
    "name": "Er-Rezzâk",
    "shortDescription": "Bütün mahlukatın rızkını veren ve ihtiyacını karşılayan.",
    "longDescription": "Bedenlerin ve ruhların gıdasını, bütün yaratıklarının rızkını yaratıp veren demektir. Allah Teâlâ, yarattığı bütün yaratıklarının rızkına kefildir. Yerde, gökte, yer altında, denizde vb. nerede canlı varsa hepsinin rızkını yaratan Allah Teâlâ’dır. Hepsinin rızkını tam vaktinde ve unutmadan verir. Ancak insanlara, yarattığı rızıkları meşrû yoldan arayıp bulmalarını emretmiştir. Bu isimden nasip alan kul, rızkın değil, Rezzâk’ın peşinden koşar. Her nimette O’nu hatırlar. Allah’ın cömertliğine hayran kalır.",
    "shortDescriptionEn": "The one who provides sustenance and fulfills the needs of all creatures.",
    "longDescriptionEn": "The one who creates and provides the sustenance for both the bodies and souls of all creatures. Allah is the guarantor of the provision for all His creations. He provides sustenance to every living being, whether on earth, in the sky, underground, or in the sea. He gives each one's provision at the perfect time, never forgetting any. However, He has commanded humans to seek His provisions through lawful means. A servant who benefits from this name seeks not the sustenance itself, but the Provider (Rezzâk). In every blessing, they remember Him and marvel at His generosity."
  },
  {
    "arabicName": "الفتاح",
    "name": "El-Fettâh",
    "shortDescription": "Her türlü zorlukları kolaylaştıran, darlıktan kurtaran.",
    "longDescription": "İyilik kapılarını açan; hakemlik yapan; bütün anlaşmazlıklarda hakemlik yaparak mutlak adâleti gerçekleştiren; zulme uğrayanlara yardım eden; mü’min kullarını zafere ulaştıran; mü’minlere mânevî kapıları açıp kalplerden kederleri gideren; her derde çare bulan; her türlü engelleri kaldıran demektir. Allah Teâlâ, yürekten, tasaları, kederleri giderendir. İnsanı sıkıntılardan kurtarıp göğsüne genişlik verendir. Anlaşılması zor ilimlerin üzerindeki zorluğu gidererek anlaşılmasını kolaylaştırandır. Allah, insana hidâyet yollarını açar.",
    "shortDescriptionEn": "The one who opens the doors of goodness and removes all difficulties.",
    "longDescriptionEn": "The one who opens the doors of goodness; the one who acts as an arbitrator and establishes absolute justice in all disputes; the one who helps those who suffer oppression; the one who brings victory to the believers; the one who opens spiritual doors and removes sorrow from the hearts of the believers; the one who finds solutions to every problem and removes all obstacles. Allah removes worry and distress from the hearts of His servants. He grants ease and expands the hearts of those in difficulty. He removes the difficulty of comprehension from challenging knowledge and makes it understandable. Allah opens the paths of guidance for people."
  },
  {
    "arabicName": "العليم",
    "name": "El-Alîm",
    "shortDescription": "Her şeyi en ince noktasına kadar bilen, ilmi ebedi ve ezeli olan.",
    "longDescription": "Hakkıyla bilen demektir. Allah Teâlâ, zaman ve yer kaydı olmaksızın büyük küçük, gizli açık her şeyi bilendir. Olmuşu, olanı, olacağı en mükemmel bir şekilde bilir. Hiç bir şey O’nun bilgisi dışına çıkamaz. O’nun bilemeyeceği bir şey düşünmek mümkün değildir.",
    "shortDescriptionEn": "The one who knows everything in its finest detail, whose knowledge is eternal and infinite.",
    "longDescriptionEn": "The one who knows everything as it truly is. Allah is the one who knows everything, big and small, hidden and revealed, without any limitation of time or place. He knows the past, the present, and the future in the most perfect manner. Nothing is outside of His knowledge. It is impossible to conceive of anything that He does not know."
  }, {
  "arabicName": "القابض",
  "name": "El-Kâbıd",
  "shortDescription": "Dilediğine darlık veren, sıkan, daraltan.",
  "longDescription": "Rızkı daraltan; canlıların ruhlarını alıp hayatlarına son veren demektir. Allah Teâlâ, istediğini sıkar, daraltır; istediğini genişletir. İstediğinden verdiği zenginliği, çoluk çocuğu, hayat zevkini, gönül ferahlığını alıverir. İhsânettiği şeyleri daraltır, azaltır. Güneşin doğmasıyla karanlığı giderir. Kuşlara gökyüzünde uçma imkânı verir, onları düşmekten korur. Bu ismi “Bâsıt” ismiyle beraber değerlendirmelidir.",
  "shortDescriptionEn": "The one who gives difficulty, constricts, and tightens as He wills.",
  "longDescriptionEn": "The one who narrows provision; the one who takes the souls of living beings and ends their lives. Allah constricts and tightens whom He wills and also expands whom He desires. He can take away wealth, family, joy, and comfort from those He wills. He narrows the gifts He has given, diminishing them. He removes darkness with the rising of the sun, provides birds the ability to fly, and protects them from falling. This name should be evaluated along with 'Bâsıt'."
},
  {
    "arabicName": "الباسط",
    "name": "El-Bâsıt",
    "shortDescription": "Dilediğine bolluk veren, açan, genişleten.",
    "longDescription": "Rızkı genişleten; ruhları bedenlerine dağıtan demektir. Allah Teâlâ, kulunu darlıktan çıkaran, sıkıntıdan kurtarandır. İlâhî imtihanın gerçekleşmesi için bazan sıkar, bazan genişletir. Bazan darlık, sıkıntı verir. Bazan bolluk, rahatlık, huzur verir. Bu ismi, “Kâbıd” ismiyle beraber değerlendirmelidir.",
    "shortDescriptionEn": "The one who grants abundance, opens, and expands.",
    "longDescriptionEn": "The one who expands provision; the one who disperses souls into bodies. Allah is the one who delivers His servant from tightness, removing hardship. He may constrict or expand as part of His divine test. Sometimes He brings difficulty and sometimes He grants ease, comfort, and peace. This name should be considered alongside 'Kâbıd'."
  },
  {
    "arabicName": "الخافض",
    "name": "El-Hâfıd",
    "shortDescription": "Yukarıdan aşağıya indiren, alçaltan.",
    "longDescription": "Alçaltan; zillete düşüren; yukarıdan aşağıya indiren demektir. Allah Teâlâ, kâfirleri, zâlimleri, zorbaları alçaltır; mü’minleri, dostlarını yükseltir. İstediği kulunu yukarıdan aşağıya atıverir. En yüksek mertebelerden en aşağı mertebelere indiriverir. Allah’ın düşürdüğünü hiç kimse yükseltemez, yükselttiğini de hiç kimse alçaltamaz. Bu ismi “Râfi’” ismiyle beraber değerlendirmelidir.",
    "shortDescriptionEn": "The one who lowers, humbles, and brings down from high to low.",
    "longDescriptionEn": "The one who lowers, humiliates, and brings down. Allah lowers the disbelievers, oppressors, and tyrants while elevating the believers and His close ones. He casts whom He wills from the highest ranks to the lowest. No one can elevate what Allah has lowered, nor can anyone lower what Allah has elevated. This name should be considered alongside 'Râfi’'."
  },
  {
    "arabicName": "الرافع",
    "name": "Er-Râfî",
    "shortDescription": "Yukarı kaldıran, yükselten.",
    "longDescription": "Yücelten, yükselten, yukarı kaldıran, şeref veren demektir. Allah Teâlâ, dilediği kuluna şeref bahşederek yükseltir, diğer kullarından üstün kılar. Dilediğini zengin kılar, şerefli kılar, saygıdeğer kılar. Dilediğine îmân bahşeder, sâlih ameller işlemesine ve cennetine girmesine imkân verir. Bu ismi, “Hâfid” ismiyle beraber değerlendirmelidir. Râfi’; dostlarının tâat ve amellerini kabul edip kendisine yaklaştıran, dünyada şerefli kılan demektir. Hâfid de; kendisine itâat etmeyenleri kendisinden uzaklaştıran, mertebelerini düşüren demektir.",
    "shortDescriptionEn": "The one who elevates, exalts, and honors.",
    "longDescriptionEn": "The one who elevates, raises, and honors. Allah grants honor to whomever He wills, raising them above others. He enriches whom He chooses, makes them honorable, and dignifies them. He grants faith to whom He wills, allowing them to perform righteous deeds and enter Paradise. This name should be considered alongside 'Hâfid'. 'Râfi’' refers to the one who accepts the obedience and deeds of His close ones, bringing them nearer and honoring them in this world. 'Hâfid' refers to the one who distances and lowers those who disobey Him."
  },
  {
    "arabicName": "المعز",
    "name": "El-Muiz",
    "shortDescription": "İzzet verip ağırlayan.",
    "longDescription": "Üstün kılan, izzet ve şeref veren; mülkü dilediğine veren demektir. Allah Teâlâ, kendisine inananları yükseltir, şereflendirir, başkalarına üstün kılar. Îmân ehli, Allah’ın azîz ve değerli kıldığı kimselerdir. “Muizz” ismini “Müzill” ismi ile beraber değerlendirmelidir.",
    "shortDescriptionEn": "The one who gives honor and strength.",
    "longDescriptionEn": "The one who honors and gives glory; the one who bestows dominion upon whom He wills. Allah elevates and dignifies those who believe in Him, making them superior to others. Those who possess faith are those whom Allah has made honorable and valuable. This name should be considered alongside 'Müzill'."
  },
  {
  "arabicName": "المذل",
  "name": "El-Muzil",
  "shortDescription": "Zillete düşüren, hor ve hakir eden.",
  "longDescription": "Zillete düşüren, hor ve hakir kılan, rezil ve perişan eden, alçaltan demektir. Gönülleri dünya hırsı ile yanıp tutuşan kişiler, Allah’ın zelil kıldıklarıdır. Bunların şiarı dünya çıkarı için nefsini alçaltmaktır. Bunlar yarın Allah’ın huzuruna yüzleri kararmış olarak çıkacaklardır. “Müzill” ismini, “Muizz” ismi ile beraber değerlendirmelidir.",
    "shortDescriptionEn": "The one who humbles, dishonors, and degrades.",
    "longDescriptionEn": "The one who humiliates, dishonors, disgraces, and lowers. Those whose hearts burn with the greed of the world are the ones whom Allah has humiliated. Their symbol is to lower their souls for worldly gains. These people will appear before Allah on the Day of Judgment with their faces darkened. The name 'Müzill' should be considered along with the name 'Muizz'."
},
  {
    "arabicName": "السميع",
    "name": "Es-Semî",
    "shortDescription": "Her şeyi işiten.",
    "longDescription": "Sonsuz işiten, her türlü kısıtlamadan yüce olarak gizli açık her şeyi işiten; işitilecek şeyler kendisine gizli kalmayan; dilek, dua ve yakarışları kabul eden demektir. Allah Teâlâ, ister açık, ister gizli bütün sesleri, fısıltıları işitir. Kendisine içinden hamd edenin hamdini işiterek onu mükâfâtlandırır. Dua edenlerin dualarını kabul eder. Allah’ın işitmesi kullarınki gibi kulak ve ses gibi bazı vasıtalarla değildir.",
      "shortDescriptionEn": "The One who hears everything.",
      "longDescriptionEn": "The infinite hearer; the one who hears everything, both openly and secretly, without any limitations. He hears all prayers, supplications, and wishes. Allah hears all sounds, whether loud or whispered. His hearing is not like human hearing, dependent on ears or sound, but is limitless."
  },
  {
    "arabicName": "البصير",
    "name": "El-Basîr",
    "shortDescription": "Her şeyi gören.",
    "longDescription": "Sonsuz görücü; her şeyi gören, bilen; kendisinden hiç bir şey saklanamayan demektir. Allah Teâlâ’nın görmesi de işitmesi ve diğer isim ve sıfatları gibi sonsuzdur. Her hangi bir organ ve vasıta ile değildir. Görme konusu olan her şeyi görür. Açıkta olanları gördüğü gibi gizli olanları da görür. Dışımızı gördüğü gibi içimizi de görür. O hâlde devamlı bir şekilde Rabbimiz tarafından görüldüğümüzü ve gözetlendiğimizi unutmamamız, buna göre söz ve davranışlarımıza dikkat etmemiz gerekir.",
      "shortDescriptionEn": "The One who sees everything.",
      "longDescriptionEn": "The infinite observer; the one who sees everything, knows everything, and from whom nothing can be hidden. Allah’s sight, like His hearing and other attributes, is limitless. He sees everything without the need for organs or means. He sees both the visible and the hidden. He observes not only our external actions but also our innermost thoughts."
  },
  {
    "arabicName": "الحكم",
    "name": "El-Hakem",
    "shortDescription": "Her işte hikmet ve adaletle hükmeden.",
    "longDescription": "Hükmeden, hakkı yerine getiren; hüküm yetkisi kendisine ait olan; son hükmü verecek olan demektir. Allah Teâlâ, hâkimdir. Her şeyin hükmünü O verir. Verdiği hükmü tamamiyle yerine getirir. O’nun hükmünü engelleyecek, bozacak, değiştirecek, geri bıraktıracak hiç kimse yoktur. Kıyâmet gününde Allah Teâlâ hükmünü verecek, adâlet tam olarak gerçekleşecek ve herkes hak ettiğinin karşılığını tam olarak alacaktır. Hiç kimseye en küçük bir haksızlık yapılmayacaktır.",
      "shortDescriptionEn": "The One who judges with wisdom and justice.",
      "longDescriptionEn": "The one who judges, the one who ensures justice; the one with authority over judgment; the one who will give the final verdict. Allah is the ultimate judge. He decrees everything and fully executes His judgment. No one can prevent, alter, or delay His decisions. On the Day of Judgment, Allah will judge, and justice will be fully realized, where everyone will receive exactly what they deserve, with no injustice to anyone."
  },
  {
    "arabicName": "العدل",
    "name": "El-Adl",
    "shortDescription": "Son derece adaletli olan.",
    "longDescription": "Mutlak adâlet sahibi, çok adâletli, asla zulmetmeyen; her şeyi yerli yerine koyan demektir. Allah Teâlâ, çok adâletlidir. Hiç kimseye en küçük bir haksızlık yapmaz. Herkes neyi hak ettiyse, herkese hakkını tam olarak verir. Yaptığı her şey, akla, mantığa, hikmet ve maslahata uygundur. Bu isimden nasip alan kul, zulmün her çeşidinden kaçınır; kendi aleyhine bile olsa adâletten ayrılmaz.",
      "shortDescriptionEn": "The One who is extremely just.",
      "longDescriptionEn": "The absolute possessor of justice, the one who is perfectly just and never wrongs anyone; the one who places everything in its rightful place. Allah is the most just, and He does not wrong anyone, not even in the slightest. He gives everyone exactly what they deserve, based on what is wise and right. The one who is inspired by this name avoids all forms of injustice and upholds fairness, even when it is against them."
  },
  {
    "arabicName": "اللطيف",
    "name": "El-Latîf",
    "shortDescription": "İşlerin bütün inceliklerini bilen.",
    "longDescription": "Yaratılmışların ihtiyaçlarını en ince ayrıntıya varıncaya kadar bilip sezilmez yollarla karşılayan; kullarına yumuşaklıkla, lütuf ve ihsânıyla muâmele eden demektir. Allah Teâlâ, kullarına iyilik ve merhamet edendir. Fiillerini yumuşaklıkla gerçekleştirendir. Sonsuz lütuf ve kerem sahibidir. Kendisine gizli olan hiç bir şey yoktur.",
      "shortDescriptionEn": "The One who knows the subtleties of everything.",
      "longDescriptionEn": "The one who knows the needs of His creation in the finest detail and provides for them through imperceptible means; the one who treats His servants with gentleness, kindness, and generosity. Allah is the most merciful and gracious, executing His actions with softness. He is the owner of infinite generosity, and nothing is hidden from Him."
  },
  {
    "arabicName": "الخبير",
    "name": "El-Habîr",
    "shortDescription": "Her şeyin iç yüzünden, gizli tarafından haberdar olan.",
    "longDescription": "Her şeyi bilen, her şeyin iç yüzünden, gizli taraflarından haberdâr olan demektir. Allah Teâlâ, yerde ve gökte, bütün evrende olan gizli açık her şeyden haberdârdır. O’nun bilemeyeceği bir şey düşünmek mümkün değildir. Bu bakımdan yaptığımız her şeyi Allah’ın bildiğini düşünerek yapmalıyız.",
      "shortDescriptionEn": "The One who is aware of the hidden realities of everything.",
      "longDescriptionEn": "The one who knows everything, the one who is aware of the inner and hidden aspects of everything. Allah is fully aware of everything, both in the heavens and on earth, in every part of the universe. Nothing can be unknown to Him. Therefore, we should act with the awareness that Allah knows everything we do."
  },
  {
  "arabicName": "الحليم",
  "name": "El-Halîm",
  "shortDescription": "Yumuşak davranan, hilmi çok olan.",
  "longDescription": "Suçluların cezasını vermeye gücü yettiği hâlde cezalandırmayıp onlar hakkında yumuşak davranan, cezalarını geriye bırakan; acele ve kızgınlıkla muâmele etmeyen demektir. Allah Teâlâ, günahları yüzünden kullarına olan lütuf ve ihsânını esirgemez. İyi olsun kötü olsun bütün kullarını rızıklandırır; belâ ve âfetlerden korur. Acelecilikle ve kızgınlıkla davranmaz. Çok yumuşak davranır. Ceza vermekte acele etmez. Süre tanır, ama ihmal etmez.",
    "shortDescriptionEn": "The One who acts with gentleness and has great forbearance.",
    "longDescriptionEn": "The One who, despite having the power to punish wrongdoers, refrains from doing so and acts with kindness towards them. He postpones their punishment and does not deal with them in haste or anger. Allah does not withhold His grace and favor from His servants due to their sins. Whether good or bad, He provides sustenance to all of His servants and protects them from calamities. He does not act in haste or anger but treats them with great gentleness. He does not rush to punish but grants time while not neglecting the wrongdoers."
},
  {
    "arabicName": "العظيم",
    "name": "El-Azîm",
    "shortDescription": "Pek azametli ve büyük olan.",
    "longDescription": "Büyük, yüce, ulu demektir. Allah Teâlâ, zât ve sıfatları bakımından en büyüktür. Mutlak ve ekmel büyüklük Allah’a mahsustur. O, hiç bir şekilde âciz bırakılmayacak olan Kâdir-i mutlaktır. Akıl, O’nun büyüklüğünü idrâkten âcizdir.",
      "shortDescriptionEn": "The One who is immensely majestic and great.",
      "longDescriptionEn": "The One who is great, exalted, and supreme. Allah is the greatest in His essence and attributes. Absolute and perfect greatness belongs solely to Him. He is the Almighty who can never be rendered helpless. The intellect is incapable of comprehending His greatness."
  },
  {
    "arabicName": "الغفور",
    "name": "El-Gafûr",
    "shortDescription": "Çok bağışlayan, magfireti çok olan.",
    "longDescription": "Günahları bağışlayan; affeden demektir. Allah Teâlâ, bağışlaması bol olandır. Kulun günahı ne kadar çok olursa olsun Allah Teâlâ, bunları meydana çıkarıp kulunu rezil ve rüsvay etmez, bunları örter ve gizler. Kulun, işlediği günahları ve suçları bağışlar. Sonsuz mağfiret edici ve bağışlayıcıdır. Bu isimden nasip alan kul, daima istiğfâra yönelir. Şahsına yapılan haksızlıkları bağışlar. Kin tutmaz.",
      "shortDescriptionEn": "The One who forgives abundantly, the Most Forgiving.",
      "longDescriptionEn": "The One who forgives sins and pardons wrongdoings. Allah is the Most Forgiving. No matter how many sins a person commits, Allah does not expose them and does not disgrace the sinner. Instead, He covers and hides their wrongdoings. He forgives the sins and wrongs of His servants. He is infinitely merciful and forgiving. Those who receive from this name continually seek forgiveness and forgive personal wrongs without holding grudges."
  },
  {
    "arabicName": "الشكور",
    "name": "Eş-Şekûr",
    "shortDescription": "Kendi rızası için yapılan iyi işleri, ziyadesiyle mükafatlandıran.",
    "longDescription": "Az iyiliğe çok mükâfât veren; kendi rızası için yapılan iyilikleri fazlasıyla mükâfâtlandıran demektir. Allah Teâlâ, kulların işlediği ibâdet ve iyilikleri fazlasıyla karşılayandır. Kul, Allah’ın verdiği nimetlere şükürle karşılık vermelidir. Kul şükrederse, Allah onun şükrünü karşılıksız bırakmaz, fazlasıyla mükâfâtlandırır.",
      "shortDescriptionEn": "The One who rewards good deeds beyond measure, abundantly grateful.",
      "longDescriptionEn": "The One who rewards even a small act of goodness with immense rewards. Allah rewards His servants' acts of worship and kindness in abundance. The servant should reciprocate Allah's blessings with gratitude. If a person is grateful, Allah will not leave their gratitude unrewarded, and He will compensate it with even more."
  },
  {
    "arabicName": "العلي",
    "name": "El-Aliyy",
    "shortDescription": "Çok yüce. Pek yüksek olan.",
    "longDescription": "Pek yüce, pek yüksek demektir. Allah Teâlâ, insan tasavvurunun tahayyül edeceği her şeyden daha büyük, daha yüce ve daha yüksekktir. İzzet, şeref ve hükümranlık bakımından O’ndan daha yüce bir varlık yoktur. O’nun yüksekliği cisimlerin sahip olduğu türden değildir. Yücelik ve üstünlük bakımındandır.",
      "shortDescriptionEn": "The One who is most exalted, the highest.",
      "longDescriptionEn": "The One who is immensely exalted and the highest. Allah is greater, more exalted, and higher than anything that human imagination can conceive. In terms of dignity, honor, and sovereignty, there is no being higher than Him. His elevation is not like the physical elevation of objects but is in terms of greatness and superiority."
  },
  {
    "arabicName": "الكبير",
    "name": "El-Kebîr",
    "shortDescription": "Büyüklüğünde hudut olmayan.",
    "longDescription": "Büyük ve ulu demektir. Allah Teâlâ, her hususta insanların kavrayamayacağı kadar ulu ve büyüktür. Zâtının ve sıfatlarının mâhiyeti bilinemeyecek kadar uludur. Mutlak büyüktür. Kudret ve hükümranlığı sınırsızdır. Hiç bir şeye muhtaç değildir. Yaratılmışlara benzemez. O’nun büyüklüğü, mekâna bağlı bir büyüklük değildir. O, bundan münezzehtir.",
      "shortDescriptionEn": "The One whose greatness has no boundaries.",
      "longDescriptionEn": "The One who is immense and exalted. Allah is immeasurably greater and more exalted than anything that human comprehension can grasp. His essence and attributes are beyond human understanding. He is absolutely great, and His power and dominion are limitless. He is independent of anything and is unlike any of His creations. His greatness is not confined to space."
  },
  {
    "arabicName": "الحفيظ",
    "name": "El-Hafîz",
    "shortDescription": "Yapılan işleri bütün tafsilatıyla, ayrıntılarıyla tutan.",
    "longDescription": "Koruyup gözeten; kendisinden gizli hiç bir şey olmayan demektir. Allah Teâlâ, evrenin düzenini koruyup sürdürendir. Her şeyi eksiksiz kaydedip hesaba çekmek üzere koruyandır. İnsanların niyetlerini ve bütün sırlarını bilendir. İnsanların söz ve hareketlerini melekler aracılığıyla tesbit ve tescil ettirendir. Dostlarını kötülüklerden koruyandır.",
      "shortDescriptionEn": "The One who preserves and protects all actions in detail.",
      "longDescriptionEn": "The One who protects and keeps everything, with nothing hidden from Him. Allah preserves and maintains the order of the universe. He keeps a perfect record of everything and will hold everyone accountable. He knows the intentions and secrets of His servants. He records every word and action of people through angels. He protects His friends from harm."
  },{
  "arabicName": "المقيت",
  "name": "El-Mukît",
  "shortDescription": "Yaratılmış her şeyin azığını veren.",
  "longDescription": "Yaratılmışların her türlü gıdalarını yaratıp veren; her şeye gücü yeten ve koruyan demektir. Allah Teâlâ, bedenlerin ve ruhların gıdasını yaratıp verendir. Yarattığı bütün canlılara ne kadar ömür takdir etmişse ona göre rızıklarını da tayin ve takdir etmiştir. Herkesin rızkı bellidir. Herkes kendi rızkını yer, kimse kimsenin rızkını yemez.",
    "shortDescriptionEn": "The One who provides sustenance for all creatures.",
    "longDescriptionEn": "The One who creates and provides sustenance for all living beings; the One who has power over all things and protects them. Allah creates and provides nourishment for both the body and soul. He determines the sustenance and lifespan of all His creations. Everyone's provision is predetermined; no one consumes another’s provision."
},
  {
    "arabicName": "الحسيب",
    "name": "El-Hasîb",
    "shortDescription": "Herkesin hayatı boyunca yaptıklarının hesabını soran.",
    "longDescription": "Kullarına yeten; onları hesaba çeken demektir. Allah Teâlâ, herkesin hayatı boyunca yapıp ettiklerinin bütün ayrıntılarıyla hesabını iyi bilendir. Bütün kullarını yaptıklarından dolayı veya yapmaları gerekenleri yapmadıklarından dolayı çok ayrıntılı bir şekilde hesaba çekecek ve herkesin hak ettiğini tam olarak verecektir.",
      "shortDescriptionEn": "The One who will hold everyone accountable for their actions.",
      "longDescriptionEn": "The One who has the power to hold His servants accountable. Allah knows the full details of everything a person has done in their life. He will hold everyone accountable for their deeds, either for what they did or for what they failed to do. He will reward each person exactly what they deserve."
  },
  {
    "arabicName": "الجليل",
    "name": "El-Celîl",
    "shortDescription": "Azamet sahibi olan, ululuk sahibi olan.",
    "longDescription": "Azamet ve ululuk sahibi demektir. Allah Teâlâ, bütün sınırlama ve benzerlikleri aşan bir yüceliğe sahiptir. Değer ve mertebece en yüce olandır. Mü’minleri yücelten, amellerini kabul edip mükâfâtlarını artırandır. O, zât, sıfat ve fiilleri itibariyle en büyüktür. O’nun büyüklüğü hacim itibariyle değildir; şân, şeref ve yücelik itibariyledir.",
      "shortDescriptionEn": "The One who is the possessor of majesty and grandeur.",
      "longDescriptionEn": "The One who possesses majesty and exaltedness. Allah has a greatness that surpasses all limitations and similarities. He is the highest in rank and status. He elevates the believers, accepts their deeds, and increases their rewards. His greatness is not based on size or volume, but on His honor, dignity, and supremacy."
  },
  {
    "arabicName": "الكريم",
    "name": "El-Kerîm",
    "shortDescription": "Çok ikram edici. Keremi ve mağfireti bol olan.",
    "longDescription": "İhsânı, in’âmı, lütfu, keremi bol olan, sonsuz cömert demektir. Allah Teâlâ, her türlü faziletin sahibidir. Hiç bir karşılık beklemeden verendir. Yardımı ve ikrâmı sonsuz ve sınırsızdır. Muktedirken, affedendir. Va’dini yerine getirendir. Kendisine sığınanı yüz üstü bırakmayandır. Az da olsa işlenen iyi ameli kabul eden, karşılığını fazlasıyla verendir. Bu isimden nasip alan kul, cimriliğin her çeşidinden kurtulur. Allah’ın kendisine verdiği nimetleri diğer kullarıyla paylaşmasını bilir. Şahsiyetini zedeleyecek her türlü rezillikten kurtulur.",
      "shortDescriptionEn": "The One who is exceedingly generous, with abundant grace and mercy.",
      "longDescriptionEn": "The One who is immensely generous, with endless benevolence, favors, and grace. Allah possesses all forms of virtue and is the giver without expecting anything in return. His help and generosity are infinite. He forgives while being in a position of power. He fulfills His promises and never forsakes those who seek refuge in Him. He accepts even small acts of goodness and rewards them generously. The one who receives from this name is freed from stinginess and shares the blessings Allah has given with others, avoiding all forms of dishonor."
  },
  {
    "arabicName": "الرقيب",
    "name": "Er-Rakîb",
    "shortDescription": "Bütün varlıklar üzerine gözcü olan.",
    "longDescription": "Her şeyi gözetleyip denetleyen; kontrol eden demektir. Allah Teâlâ, yaratıklarından bir an bile gâfil değildir. Kim ne yaparsa onu görür ve bilir. Hiçbir şey Allah’tan gizli kalmaz. Bütün varlıklar üzerinde gözcüdür, gözetleyicidir. Bütün işler O’nun denetimi ve gözetimi altında meydana gelmektedir. O, bütün olan bitenlere şahittir. Herkese yaptığının karşılığını verir.",
      "shortDescriptionEn": "The One who is the watcher over all things.",
      "longDescriptionEn": "The One who observes, supervises, and controls everything. Allah is never unaware of His creatures. He sees and knows everything that happens. Nothing is hidden from Him. He is the overseer of all things, and all events occur under His watchful supervision. He is a witness to everything and will reward each person according to their actions."
  },
  {
    "arabicName": "المجيب",
    "name": "El-Mücîb",
    "shortDescription": "Dua edenlerin dualarını kabul eden, isteklerini veren.",
    "longDescription": "Kendine yalvaranların isteklerini veren; kullarının dileklerine ve dualarına karşılık veren demektir. Allah Teâlâ, kullarına, onlardan daha yakındır. Kendine yalvaranları işitir, bilir ve onların isteklerini verir. İnsanın duâya şiddetle ihtiyacı vardır. Duâ, bir bakıma ibâdettir. Duâdan mahrum kalmamak lazımdır.",
      "shortDescriptionEn": "The One who answers the prayers of those who call upon Him.",
      "longDescriptionEn": "The One who grants the wishes and prayers of those who call upon Him. Allah is closer to His servants than anyone else. He hears, knows, and answers the requests of those who call out to Him. Humans are in dire need of supplication. Prayer is, in a way, a form of worship, and one should never be deprived of it."
  },
  {
    "arabicName": "الواسع",
    "name": "El-Vâsî",
    "shortDescription": "Lütfu bol olan.",
    "longDescription": "İlmi ve merhameti her şeyi kuşatan demektir. Allah Teâlâ, kullarına bolca ihsân eden, rızıklarını genişletendir. Allah ilim, lütuf ve ihsânı ile her şeyi kuşatmıştır. Nimetlerinin bir kısmı fayda sağlayan türden, diğer bir kısmı da zararları gideren türdendir.",
      "shortDescriptionEn": "The One who is vast in His grace and mercy.",
      "longDescriptionEn": "The One whose knowledge and mercy encompass everything. Allah grants abundant favor and extends sustenance to His servants. His knowledge, grace, and generosity encompass all things. Some of His blessings provide benefit, while others remove harm."
  },
  {
    "arabicName": "الحكيم",
    "name": "El-Hakîm",
    "shortDescription": "Emirleri, kelamı ve bütün işleri hikmetli olan.",
    "longDescription": "Hikmet sahibi demektir. Allah Teâlâ, yaptığı her şeyi yerli yerince, eksiksiz ve tam yapar. En üstün bir ilim sahibidir ve yaptığı her şey mutlaka bir hikmete mebnîdir; hikmetsiz asla iş yapmaz. Bütün emirleri insanların yararına olduğu gibi bütün yasakları da insanların zararınadır.",
      "shortDescriptionEn": "The One whose commands, speech, and actions are full of wisdom.",
      "longDescriptionEn": "The One who is full of wisdom. Allah does everything in its perfect place, flawlessly and thoroughly. He is the possessor of the highest knowledge, and everything He does is based on wisdom. He never acts without wisdom. All His commands are for the benefit of humans, and all His prohibitions are for their harm."
  },
  {
    "arabicName": "الودود",
    "name": "El-Vedûd",
    "shortDescription": "İyi kullarını seven, sevilmeye ve dostluğa hakkıyla layık olan.",
    "longDescription": "Çok seven ve çok sevilen; sevilmeye lâyık olan demektir. Allah Teâlâ, sâlih kullarını sever, sâlih kulları da Allah’ı sever. Sâlih kullarından râzıdır. Allah yaratılmış bütün varlıkların hayrını ister. Bu nedenle onlara ihsân ve ikrâmlarda bulunur. Sevilmeye en çok lâyık olan da O’dur. Her mü’minin hedefi Allah dostluğunu kazanabilmek olmalıdır. Bunun için her türlü fedakârlığa katlanmalıdır. Bu isimden nasip alan kul, hem Allah adına herkesi, her şeyi sever; hem de herkes tarafından sevilir.",
      "shortDescriptionEn": "The One who loves His righteous servants, worthy of love and friendship.",
      "longDescriptionEn": "The One who loves greatly and is greatly loved; the One worthy of love. Allah loves His righteous servants, and they love Him in return. He is pleased with His righteous servants. Allah desires good for all His creations and thus grants them kindness and favors. He is the most deserving of love. Every believer should aim to win the friendship of Allah, for which they should be willing to make all kinds of sacrifices. The one who gains from this name will love everyone and everything for the sake of Allah and will be loved by all."
  },
  {
    "arabicName": "المجيد",
    "name": "El-Mecîd",
    "shortDescription": "Şanı çok büyük ve çok yüksek olan.",
    "longDescription": "Şânı büyük, yüksek; lütuf ve ikrâmı bol demektir. Allah Teâlâ, her türlü eksikliklerden yücedir. Şânı büyüktür. Lütuf ve keremi çoktur. Her türlü övgüye lâyıktır. Affı, ihsânı, rahmeti ve yardımı sonsuzdur. Nimetleri saymakla bitmez.",
      "shortDescriptionEn": "The One whose glory is great and exalted.",
      "longDescriptionEn": "The One who is glorious and exalted; the One with abundant grace and favor. Allah is free from any imperfections. His glory is vast. His kindness and generosity are immense. He is worthy of all praise. His forgiveness, grace, mercy, and help are infinite. His blessings are countless."
  },
  {
    "arabicName": "الباعث",
    "name": "El-Bâis",
    "shortDescription": "Ölüleri diriltip kabirlerinden çıkaran.",
    "longDescription": "Ölüleri dirilten, Peygamber gönderen demektir. Allah Teâlâ, öldükten sonra diriltendir. İnsanlar ölüp toprak olduktan sonra onları diriltecek, kabirlerinden çıkaracak, mahşerde toplayacak, çok ayrıntılı bir şekilde hesaba çekecektir. Allah Teâlâ, aynı zamanda insanlara doğru yolu göstermek üzere Peygamberler gönderendir. Peygamberlere uyanlar kurtulacak, uymayanlar azâbı hak edeceklerdir.",
      "shortDescriptionEn": "The One who resurrects the dead and brings them forth from their graves.",
      "longDescriptionEn": "The One who brings the dead to life and sends Prophets. Allah is the One who will resurrect people after they have died, bringing them forth from their graves and gathering them on the Day of Judgment. He will hold them accountable in great detail. Allah also sends Prophets to guide people on the right path. Those who follow the Prophets will be saved, while those who reject them will deserve punishment."
  },
  {
    "arabicName": "الشهيد",
    "name": "Eş-Şehîd",
    "shortDescription": "Her zaman ve her yerde hazır ve nazır olan.",
    "longDescription": "Her zaman, her yerde hazır olan; her şeye şâhit olan; kendisine hiçbir şey gizli olmayan demektir. Allah Teâlâ, her şeyi bilendir. İlminden hiç bir şey gizli olmayandır. Allah, açıkta olanları da bilir, gizli olanları da bilir. O, her şeye şâhittir. Âhirette herkese halini bildirecektir.",
      "shortDescriptionEn": "The One who is always present and witnessing everything.",
      "longDescriptionEn": "The One who is always present, witnessing everything; the One to whom nothing is hidden. Allah is the One who knows all things. Nothing is concealed from His knowledge. He knows both the open and the hidden. He is a witness to everything. In the Hereafter, He will make everyone aware of their deeds."
  },
  {
    "arabicName": "الحق",
    "name": "El-Hakk",
    "shortDescription": "Vacibul vücut olan, varlığı hiç değişmeden duran.",
    "longDescription": "Varlığı gerçek olan, varlığı hiç değişmeden duran; varlığı ve ilâhlığı kesin olan, hükmünün gereğini yerine getiren demektir. Allah Teâlâ, varlığı ve ilâhlığı kesin olan, inkârı mümkün olmayandır. O’nun zâtı yokluğu kabul etmediği gibi bir değişikliği de kabul etmez. Hükmünün gereğini yerine getirendir. Ezelî ve ebedî olandır. Değişmeksizin varlığı devam edendir. Varlığı fiilen gerçek olandır yani sadece zihinde değil, zihnin dışında da var olandır.",
      "shortDescriptionEn": "The One whose existence is absolute, unchanging.",
      "longDescriptionEn": "The One whose existence is real, unchanging and permanent. Allah is the One whose existence and divinity are definite and undeniable. His essence does not accept non-existence, nor does it accept change. He is the One who carries out His decrees. He is eternal and everlasting. His existence is real, not just in the mind, but also in reality."
  },
  {
    "arabicName": "الوكيل",
    "name": "El-Vekîl",
    "shortDescription": "İşlerini kendisine bırakanların işini düzelten ve her şeyin iyisini temin eden.",
    "longDescription": "İşlerini kendisine bırakanların işlerini en mükemmel bir şekilde yapan; kendisine güvenilip dayanılan demektir. Allah Teâlâ, her bakımdan insanın güvenip dayanacağı varlıktır. En güzel vekildir, en büyük vekildir. Yarattığı bütün varlıkların işlerini idare edendir. Allah Teâlâ, elinden geleni yaptıktan sonra işini Allah’a havale edeni, mükâfâtlandırır.",
      "shortDescriptionEn": "The One who manages the affairs of those who trust in Him.",
      "longDescriptionEn": "The One who handles the affairs of those who entrust their matters to Him in the most perfect way. Allah is the One whom people rely on and trust. He is the best and greatest trustee. He manages the affairs of all His creations. Allah rewards those who do their best and then rely on Him."
  },
  {
    "arabicName": "القوي",
    "name": "El-Kaviyy",
    "shortDescription": "Pek kuvvetli. Pek güçlü olan.",
    "longDescription": "Pek güçlü; gücü her şeye yeten demektir. Allah Teâlâ, tam bir kudret sahibidir. Gücü, kuvveti sonsuzdur; bitmez, tükenmez. Bir sınıra sığmaz, ölçüye gelmez. Nicelik ve nitelik bakımından üstün kudrete sahiptir. Gücünün yetmeyeceği bir şey düşünülemez. O, her şeyi etkiler, ama hiç bir şey O’nu etkileyemez.",
      "shortDescriptionEn": "The One who is exceedingly strong and powerful.",
      "longDescriptionEn": "The One who is exceedingly powerful, whose strength is infinite. Allah possesses absolute power, an endless and inexhaustible strength. His power is beyond measure, beyond limits. He holds supreme power in both quantity and quality. There is nothing that He cannot do, and nothing can affect Him."
  },
  {
    "arabicName": "المتين",
    "name": "El-Metîn",
    "shortDescription": "Çok sağlam olan.",
    "longDescription": "Sonsuz kudrete sahip; son derece güçlü, kuvvetli; dayanıklı, sağlam demektir. Allah Teâlâ, sonsuz bir güce sahiptir. Fiillerinden dolayı zatına her hangi bir zorluk ve yorgunluk ilişmez. Kuvveti azalıp gevşemez. Hiçbir şey O’nu âciz bırakamaz. Hiç kimsenin yardımına da muhtaç değildir. Allah’ın “Kaviyy” ismi, kudretinin kemâlini ifâde eder. Bütün nesne ve olayları etkileyendir. “Metîn” ismi, kuvvetinin şiddetini bildirir. Dıştan gelebilecek hiç bir etkiyi kabul etmeyendir.",
      "shortDescriptionEn": "The One who is exceedingly firm and unshakable.",
      "longDescriptionEn": "The One who possesses infinite strength and is extremely powerful, unshakable, and unbreakable. Allah has an endless power. His actions do not tire or weaken His essence. His strength never diminishes. Nothing can overpower Him. He is not dependent on anyone else’s assistance. The name ‘Kaviyy’ indicates the perfection of His power, while ‘Metîn’ shows the intensity of His strength, meaning no external force can affect Him."
  },
  {
    "arabicName": "الولي",
    "name": "El-Veliyy",
    "shortDescription": "İyi kullarına, gerçek mü’minlere dost olan.",
    "longDescription": "Dost ve yardımcı demektir. Allah Teâlâ, sevdiği kullarının dostudur. Onlara yardım eder; sıkıntılarını, darlıklarını giderir; ferahlık verir. Dünya ve âhiret işlerinde başarıya ulaştırır. Mü’minlerin yardımcısı ve koruyucusudur. Allah’tan başka gerçek dost ve yardımcı yoktur.",
      "shortDescriptionEn": "The One who is the protector and helper of His righteous servants.",
      "longDescriptionEn": "The One who is a true friend and helper. Allah is the protector and supporter of His beloved servants. He aids them, removes their distress, and grants them peace and success in both worldly and spiritual matters. He is the helper and protector of the believers. There is no real helper or protector other than Allah."
  },
  {
    "arabicName": "الحميد",
    "name": "El-Hamîd",
    "shortDescription": "Her türlü hamd ve övgüye layık olan.",
    "longDescription": "Övülmeye lâyık olan demektir. Allah Teâlâ, bütün isimleri, sıfatları ve fiilleriyle övülmeye tek lâyık olan zâttır. Bütün varlığın diliyle övülen ve şükredilendir. Allah Teâlâ, bizâtihî övülmeye lâyık olandır. Aynı zamanda insanların işledikleri iyi fiiller sebebiyle onları över ve mükâfâtlandırır.",
      "shortDescriptionEn": "The One who is worthy of all praise and gratitude.",
      "longDescriptionEn": "The One who is worthy of all praise. Allah is the only being deserving of all praise for His names, attributes, and actions. He is praised by all of creation, and He is the One who is deserving of all gratitude. He is also the One who praises His servants for their good deeds and rewards them accordingly."
  },
  {
    "arabicName": "المحصي",
    "name": "El-Muhsî",
    "shortDescription": "İstisnasız her şeyin tek tek sayısını bilen.",
    "longDescription": "Sonsuz ilmiyle her şeyin sayısını bilen, her yapılanı bir bir sayan demektir. Allah Teâlâ, sonsuz ilmi ile her şeyi kuşatmıştır. Her şeyi tek tek ve bütün ayrıntılarıyla bilendir. O’nun ilminden hiç bir şey hariç kalamaz. Bütün amellerin sayısını bilir, kıyâmet günü bunların hepsinin karşılığını verir. Hiç birini unutmaz ve atlamaz.",
      "shortDescriptionEn": "The One who knows the exact count of everything.",
      "longDescriptionEn": "The One who knows the number of everything with His infinite knowledge. Allah encompasses all things with His knowledge and knows everything in detail. Nothing escapes His knowledge. He knows the exact number of every action, and on the Day of Judgment, He will reward each one accordingly. None of them will be forgotten or overlooked."
  },
  {
    "arabicName": "المبدئ",
    "name": "El-Mübdi",
    "shortDescription": "Bütün mahlukatı maddesiz ve örneksiz olarak ilk baştan yaratan.",
    "longDescription": "Yaratıkları maddesiz ve örneksiz olarak ilk baştan yaratan demektir. Allah Teâlâ, kâinâtı yaratırken daha önce bir benzeri ve örneği olmaksızın yaratmıştır. İşte esas yaratma denilen, ilk maddesi, örneği olmaksızın yaratmadır. Bu, yoktan var etmedir ve Allah’a mahsustur.",
      "shortDescriptionEn": "The One who creates all beings from nothing, without any example.",
      "longDescriptionEn": "The One who creates all beings from nothing, without any prior matter or example. Allah created the universe without any precedent or example. This is the essence of creation: bringing forth something from nothing, a creation exclusive to Allah."
  },
  {
    "arabicName": "المعيد",
    "name": "El-Muid",
    "shortDescription": "Yaratılmışları yok ettikten sonra tekrar yaratan.",
    "longDescription": "Yaratılmışları öldürdükten, yok ettikten sonra tekrar yaratan; öldükten sonra dirilten demektir. Allah Teâlâ, ilk defa yarattığı bütün insanları öldürecek, sonra tekrar diriltecek ve dünya hayatlarındaki inanç ve amellerinden hesaba çekecektir. Hayat, sadece dünya hayatından ibaret değildir. Tekrar bir hayat vardır ki gerçek ve devamlı hayat budur. İnsanlar buna göre hareket etmelidir.",
      "shortDescriptionEn": "The One who re-creates after destruction.",
      "longDescriptionEn": "The One who re-creates after destruction and death. Allah will cause all of humanity to die and then resurrect them. The life we experience on earth is not the final one; there is a true and eternal life that comes after. People should prepare for that everlasting life."
  },
  {
    "arabicName": "المحيي",
    "name": "El-Muhyî",
    "shortDescription": "İhya eden, dirilten, can bağışlayan, sağlık veren.",
    "longDescription": "Can veren, yaşatan demektir. Allah Teâlâ, can bağışlayan, sağlık verendir. Ölüleri diriltendir. Ölü beldeleri gökten indirdiği su ile canlandıran, yeryüzünü bitkilerle donatandır. İlk olarak yaratan, can veren Allah, öldükten sonra tekrar hayat vermeye kâdirdir. Ölü kalpleri ilâhî hidâyet ve marifetle canlandırandır.",
      "shortDescriptionEn": "The One who gives life and revives.",
      "longDescriptionEn": "The One who grants life, revitalizes, and heals. Allah gives life, revives the dead, and brings life to barren lands through rain. He is the One who gives life initially and has the power to revive again after death. He also revives dead hearts through divine guidance."
  },
  {
    "arabicName": "المميت",
    "name": "El-Mümît",
    "shortDescription": "Ölümü yaratan, öldüren.",
    "longDescription": "Öldüren, canlının hayatına son veren demektir. Allah Teâlâ, canlılara hayat verdiği gibi, ezelî ilmindeki takdire göre vakti gelince bu hayatlara son verendir. Fânî hayat, doğumla başlar, ölümle biter. Hayat dediğimiz ruhla cesedin birleşmesidir. Ölüm ise ruhun cesedden ayrılmasıdır. Ruh, ölmez. Başka bir hayatla devam eder. Kul için, ölüm sonrası başlayacak yeni ve devamlı hayata iyi hazırlık yapmak mühimdir.",
      "shortDescriptionEn": "The One who gives death.",
      "longDescriptionEn": "The One who causes death and ends life. Allah is the One who gives life, and in His eternal knowledge, He determines when life ends. Mortal life begins with birth and ends with death. Death occurs when the soul separates from the body, but the soul itself is eternal and continues in another life. Preparing for the afterlife is crucial for every believer."
  },
  {
    "arabicName": "الحي",
    "name": "El-Hayy",
    "shortDescription": "Diri, tam ve mükemmel manasıyla hayat sahibi.",
    "longDescription": "Diri, canlı olan; ölmek şânından olmayan demektir. Allah Teâlâ, bütün hayatların kaynağıdır. Hep diridir. Allah’ın hayy (diri) oluşu, yaratılmış varlıklarda olduğu gibi organik bir canlılık değildir. Hiç bir şeyden gâfil olmayan, hata yapmayan, kâinâtta kendisinden hiç bir şey gizli olmayan demektir.",
      "shortDescriptionEn": "The One who is eternally alive, perfect and complete in life.",
      "longDescriptionEn": "The One who is eternally alive, who never dies. Allah is the source of all life, and He is always alive. His life is not like the organic life of created beings, for He is free from all imperfection. He is aware of everything, never errs, and nothing is hidden from Him in the entire universe."
  },
  {
    "arabicName": "القيوم",
    "name": "El-Kayyûm",
    "shortDescription": "Gökleri, yeri ve her şeyi tutan.",
    "longDescription": "Olup kimseye muhtaç değildir. Ezelî ve ebedîdir. Her şeyin varlık kazanması ve varlığını devam ettirmesi ancak Allah’ın yaratması, maddî mânevî ihtiyaçlarını gidermesi ve korumasıyla mümkündür. Yeri, gökleri ayakta tutan O’dur.",
      "shortDescriptionEn": "The One who sustains and maintains the heavens, earth, and everything.",
      "longDescriptionEn": "The One who is self-sustaining and independent of anyone. Allah is eternal and everlasting, and everything's existence depends on His creation and preservation. Everything continues to exist because Allah provides for and upholds it. He is the One who keeps the heavens, the earth, and everything in between standing."
  },{
  "arabicName": "الواجد",
  "name": "El-Vâcid",
  "shortDescription": "İstediğini, istediği vakit bulan.",
  "longDescription": "İstediğini istediği zaman bulan; hiç bir şeye muhtaç olmayan demektir. Allah Teâlâ, dilediği şeye sahip olur. Bu hususta bir engelle karşılaşmaz. Bir şeyi ele geçirmek istediğinde zaman kollamaya, tedbir almaya, tuzak kurmaya ihtiyacı yoktur. İstediği, istediği zaman O’nun huzurundadır. Bütün yaratıklar O’nun emri ve tasarrufu altındadır.",
    "shortDescriptionEn": "The One who finds what He desires at any time.",
    "longDescriptionEn": "The One who finds whatever He desires at the time He chooses; the One who is in no need of anything. Allah possesses whatever He desires without any hindrance or limitation. He doesn't need to plan, strategize, or lay traps. What He wants is always in His presence, and everything is under His command."
},
  {
    "arabicName": "الماجد",
    "name": "El-Mâcid",
    "shortDescription": "Kadri büyük, keremi bol olan.",
    "longDescription": "Şânı ve kadri büyük; kerem ve cömertliği bol demektir. Allah Teâlâ, yardımı, ihsânı bol olandır. O’nun kullarına olan kerem ve cömertliği ifâdeye sığmaz, ölçüye gelmez. Bir taraftan kullarını iyi işler yapmaya muvaffak kılar; öbür taraftan onları güzel sıfatlara sahip olduklarından över.",
      "shortDescriptionEn": "The One with great honor, abundant grace.",
      "longDescriptionEn": "The One whose glory and rank are immense; the One who is full of generosity and kindness. Allah is the One whose help and grace are abundant. His generosity towards His servants is immeasurable, and He blesses them with success in good deeds while praising them for their virtuous qualities."
  },
  {
    "arabicName": "الواحد",
    "name": "El-Vâhid",
    "shortDescription": "Tek olan.",
    "longDescription": "Bir olan, tek olan; zâtında, sıfatlarında, isimlerinde ve fiillerinde asla ortağı, dengi ve benzeri bulunmayan demektir. Allah Teâlâ, tektir, bölünüp parçalara ayrılmaz. Benzeri yoktur. Allah’ın bir olması sayı bakımından değildir, büyüklük ve yücelik açısındandır. O, bölünmesi ve artması mümkün olmayan tek bir varlıktır.",
      "shortDescriptionEn": "The One who is unique and singular.",
      "longDescriptionEn": "The One who is absolutely unique and singular; there is no partner, equal, or likeness in His essence, attributes, names, or actions. Allah is one, indivisible, and incomparable. His oneness is not in terms of numbers, but in His greatness and supremacy. He is the only existence that cannot be divided or increased."
  },
  {
    "arabicName": "الصمد",
    "name": "Es-Samed",
    "shortDescription": "Sığınacak tek dayanak olan.",
    "longDescription": "Her şeyin kendisine muhtaç olduğu, kendisinin hiç bir şeye muhtaç olmadığı; ihtiyaçların giderilmesi ve ızdırapların dindirilmesi için başvurulacak tek merci demektir. Allah Teâlâ, yaratıkların her türlü ihtiyaçlarını gidermek için başvurdukları tek başvuru kaynağıdır. Her türlü yaratığın her türlü ihtiyacını en mükemmel bir şekilde karşılar ve giderir. Kendisi ise hiç bir şeye muhtaç değildir.",
      "shortDescriptionEn": "The One to whom all turn for help, yet in no need of anyone.",
      "longDescriptionEn": "The One whom everything depends on, but who depends on nothing. He is the ultimate source of help, the one to whom all creation turns for fulfillment of needs and relief from distress. Allah answers every need, providing the most perfect solutions, while He Himself is in no need of anyone or anything."
  },
  {
    "arabicName": "القدير",
    "name": "El-Kâdir",
    "shortDescription": "Her şeye gücü yeten, her istediğini yapmaya kâdir olan.",
    "longDescription": "Her şeye gücü yeten; kudret sahibi demektir. Allah Teâlâ, istediğini, istediği gibi yapmaya gücü yetendir. Her şeyi takdir eden, planlı ve ölçülü yapandır. Hiçbir şey O’nu âciz bırakamaz. Âlem, mutlak irâde ve kudrete sahip olan Allah tarafından yaratılmıştır.",
      "shortDescriptionEn": "The One who has power over all things.",
      "longDescriptionEn": "The One who has power over all things; the One who is capable of doing whatever He desires. Allah's power is absolute, and He does everything according to a precise plan and measure. Nothing can weaken or overpower Him. The universe and everything in it were created by His will and might."
  },
  {
    "arabicName": "المقتدر",
    "name": "El-Muktedir",
    "shortDescription": "Kuvvet ve kudret sahipleri üzerinde dilediği gibi tasarruf eden.",
    "longDescription": "Tam bir kudret sahibi; her şeye gücü yeten demektir. Allah Teâlâ, kuvvet ve kudret sahipleri üzerinde istediği gibi tasarruf edendir. O’nun “Kâdir” oluşu, istediğini, istediği anda ve istediği şekilde yaratma gücüne sahip olması demektir. “Muktedir” olması ise, bilfiil gücünü yarattıklarında göstermesidir.",
      "shortDescriptionEn": "The One who exercises full control over all powers.",
      "longDescriptionEn": "The One who has complete and absolute power over all forces. Allah is the One who governs and exercises control over all beings with power and strength. His ability to create and command is not limited by time or space, and He manifests His power in all that He creates."
  },
  {
    "arabicName": "المقدم",
    "name": "El-Mukaddim",
    "shortDescription": "İstediğini ileri geçirip, öne alan.",
    "longDescription": "İstediğini öne alan, ileri geçiren demektir. Allah Teâlâ, dilediği şeyi veya kimseyi öne alan, önde bulundurandır. Allah’ın daveti geneldir. Fakat hidâyet ettikleri davete uyar, ileri gider. Hidâyet etmedikleri geri kalır. Allah’ın emir ve yasakları bütün kullar içindir. Fakat Allah’ın muvaffak ettikleri bunlara uyar, yükselir; muvaffak etmedikleri geride kalır. O hâlde hem akıl ve irâdemizi Allah’a îmân ve itâat yönünde kullanmalı, hem de Allah’tan hidâyet istemelidir. “Mukaddim” ismi, “Muahhir” ismiyle beraber değerlendirilmelidir.",
      "shortDescriptionEn": "The One who advances or elevates whom He wills.",
      "longDescriptionEn": "The One who elevates or advances whatever or whoever He wills. Allah is the One who brings forward those or things He chooses. His call is general, but those He guides will follow, advancing forward, while others remain behind. His commands apply to all His creatures, but only those whom He grants success will rise to follow His guidance."
  },
  {
    "arabicName": "المؤخر",
    "name": "El-Muahhir",
    "shortDescription": "İstediğini geri koyan, arkaya bırakan.",
    "longDescription": "İstediğini geri koyan, arkaya bırakan demektir. Allah Teâlâ, hikmeti gereği geri bırakılması gerekenleri geri bırakır. “Mukaddim” ismi ile ilgili açıklamalarımız “Muahhir” ismi ile de ilgilidir. Esasen bu iki isim beraber değerlendirilmelidir. Bazan Allah Teâlâ, kulların istediklerini bir hikmeti gereği geri bırakır. İmtihan dünyasında olduğumuzu unutmamamız gerekir.",
      "shortDescriptionEn": "The One who delays or puts things behind.",
      "longDescriptionEn": "The One who delays or holds back whatever He wills. Allah, in His wisdom, delays or puts back whatever needs to be postponed. This name is often understood alongside the name 'Al-Mukaddim'. Sometimes, Allah holds back things from His servants for a divine purpose, and we must remember that this world is a place of testing."
  },
  {
    "arabicName": "الأول",
    "name": "El-Evvel",
    "shortDescription": "Başlangıcı olmayan, ilk olan.",
    "longDescription": "İlk; varlığının başlangıcı olmayan demektir. Allah Teâlâ, bütün varlıklardan öncedir. Varlığının bir evveli, başlangıcı yoktur. O, kadîmdir, ezelîdir. Varlığı kendi zâtıyladır. Bütün varlıklar varlığını O’ndan almaktadır. Yaratmayı başlatan O’dur. “Evvel” ismini “Âhir” ismiyle beraber değerlendirilmelidir.",
      "shortDescriptionEn": "The First, with no beginning.",
      "longDescriptionEn": "The One whose existence has no beginning. Allah is prior to all creation, and His existence has no start. He is eternal and beyond time. All beings derive their existence from Him, and He is the One who initiated creation. The names 'Evvel' (The First) and 'Âhir' (The Last) should be considered together."
  },
  {
    "arabicName": "الآخر",
    "name": "El-Âhir",
    "shortDescription": "Bitişi olmayan, son olan.",
    "longDescription": "Varlığının sonu olmayan demektir. Allah Teâlâ, varlığı devamlı olandır. Varlığının başlangıcı olmadığı gibi sonu da yoktur. Allah, eşyanın evveli olması bakımından “Evvel”dir. Eşyanın sonu Allah’tan olması bakımından da “Âhir”dir. “Âhir” ismini, “Evvel” ismiyle beraber değerlendirilmelidir.",
      "shortDescriptionEn": "The Last, with no end.",
      "longDescriptionEn": "The One whose existence has no end. Allah is the One whose existence is eternal, with neither beginning nor end. In relation to creation, He is the First ('Evvel'), and He is also the Last ('Âhir'). These two names should be understood in relation to each other."
  },
  {
    "arabicName": "الظاهر",
    "name": "Ez-Zâhir",
    "shortDescription": "Açıkça bilinen, âşikâr olan.",
    "longDescription": "Varlığı apaçık demektir. Allah Teâlâ, varlığını ve birliğini belgeleyen birçok delil bulunması açısından aşikârdır. Her şeyin üstünde olan, her şeyden yüce olandır. Allah’ın varlığı o kadar açıktır ki insanın gördüğü her şey, ibret nazarıyla baktığı takdirde onu, Allah’a götürür. “Zâhir” ismi, “Bâtın” ismiyle beraber değerlendirilmelidir.",
      "shortDescriptionEn": "The Manifest, clearly evident.",
      "longDescriptionEn": "The One whose existence is manifest. Allah's existence and oneness are proven by countless evidences. He is above all things, and His presence is so clear that everything, when observed with reflection, leads to Him. The names 'Zâhir' (The Manifest) and 'Bâtın' (The Hidden) should be understood together."
  },
  {
    "arabicName": "الباطن",
    "name": "El-Bâtın",
    "shortDescription": "Gizli olan.",
    "longDescription": "Zâtının görülmesi ve mâhiyetinin bilinmesi açısından gizli demektir. Allah Teâlâ, gizlidir. Çünkü O, gözle görülemez, künhüyle bilinemez. İnsan, her şeyiyle sınırlıdır. Allah ise, sınırsızdır. Sınırlı olan sınırsız olanı idrâk ve ihâta edemez. “Bâtın” ismi, “Zâhir” ismiyle beraber değerlendirilmelidir.",
      "shortDescriptionEn": "The Hidden, not visible.",
      "longDescriptionEn": "The One who is hidden in essence and whose true nature cannot be fully comprehended. Allah is beyond human perception, and He cannot be seen or fully known by limited beings. While humans are restricted in understanding, Allah is limitless. The names 'Bâtın' (The Hidden) and 'Zâhir' (The Manifest) should be interpreted together."
  },
  {
    "arabicName": "الوالي",
    "name": "El-Vâlî",
    "shortDescription": "Her şeyi tek başına idare eden.",
    "longDescription": "Kâinatın tek hâkimi, yöneticisi demektir. Allah Teâlâ, bu büyük evreni ve her an meydana gelen bütün olayları tek başına yönetendir. Yaratıkların işlerini yerine koyandır. Bütün varlıkların tek hükümdârı olup onlar üzerinde istediği şekilde tasarrufta bulunandır. Dirilten ve öldüren O’dur. Hiç bir şey O’nun tasarrufunun dışında kalmaz.",
      "shortDescriptionEn": "The Sole Manager, governing everything alone.",
      "longDescriptionEn": "The One who governs and manages all things in the universe by Himself. Allah is the sole ruler and administrator of the entire cosmos, directing every event and ensuring the functioning of all creatures. He is the One who gives life and takes it, and nothing exists outside of His will."
  },
  {
    "arabicName": "المتعالي",
    "name": "El-Müteâlî",
    "shortDescription": "Aklın mümkün gördüğü her şeyden, her hâl ve tavırdan münezzeh olan.",
    "longDescription": "İzzet, şeref ve hükümranlık bakımından en yüce demektir. Allah Teâlâ, yaratılmışlar hakkında aklın mümkün gördüğü her şeyden, her hal ve tavırdan yücedir. Zât, sıfat ve fiilleri açısından yaratılmışlara benzemekten, denk ve ortağı bulunmaktan yücedir.",
      "shortDescriptionEn": "The Most Exalted, above all that is conceivable.",
      "longDescriptionEn": "The One who is exalted in honor, dignity, and sovereignty. Allah is far above anything that human intellect can conceive, in terms of His essence, attributes, and actions. He is not like His creation and is incomparable to anything."
  },
  {
    "arabicName": "البر",
    "name": "El-Berr",
    "shortDescription": "Kullarına iyilik ve ihsanı, nimetleri bol olan.",
    "longDescription": "İyilik ve bahşişi çok olan; va’dini yerine getiren demektir. Allah Teâlâ, kulları hakkında kolaylık isteyendir. Yaratıklarına karşı rahmet ve mağfireti; lütuf ve ihsânı bol olandır. Kullarının hep iyiliğini ister, kötülüklerini ve zorluk çekmelerini istemez. Yapılan kötülüklerin çoğunu bağışlar, örtbas eder.",
      "shortDescriptionEn": "The Benefactor, full of kindness and grace.",
      "longDescriptionEn": "The One who abundantly bestows goodness, kindness, and generosity. Allah desires ease and kindness for His servants, always wishing for their well-being and forgiveness. He is generous in mercy, covering their mistakes and granting them blessings, while never wanting harm or difficulty for them."
  },
  {
    "arabicName": "التواب",
    "name": "Et-Tevvâb",
    "shortDescription": "Tövbeleri kabul eden.",
    "longDescription": "Tövbe eden kullarının tövbelerini kabul eden ve tövbede muvaffak kılan demektir. Allah Teâlâ, kullarını tövbeye sevkeden ve tövbelerini kabul edendir. Kendisine yönelen kullarının günahlarını affedendir. Tövbeleri kabul edip günahları bağışlayandır. Kul, işlediği günahlardan pişman olur, tövbeye yönelirse Allah onu tövbesinde başarılı kılar ve tövbesini kabul eder.",
      "shortDescriptionEn": "The Accepter of repentance.",
      "longDescriptionEn": "The One who accepts the repentance of His servants and grants them success in repentance. Allah leads His servants to repentance and forgives their sins when they turn to Him in remorse. He erases the sins of those who sincerely repent and grants them success in their repentance."
  },
  {
    "arabicName": "المنتقم",
    "name": "El-Müntakim",
    "shortDescription": "Suçluları adaletiyle cezalandırıp intikam alan.",
    "longDescription": "Suçlulara, adâleti ile hak ettikleri cezayı veren demektir. Allah Teâlâ, suçluları hemen cezalandırmaz. Onları çeşitli yollarla uyarır. Yanlış davranışından dönmesi için kendisine fırsat ve yeterli zaman verir. Tövbe etmeyenleri cezalandırır. Fakat bu cezalandırma kendisi için değildir; zulüm ve gadre uğrayanlar içindir. Allah, dostlarından değil, düşmanlarından intikam alır.",
      "shortDescriptionEn": "The Avenger, exacting justice.",
      "longDescriptionEn": "The One who punishes the wrongdoers with justice and takes revenge. Allah does not hastily punish the wrongdoers; He warns them through various means, giving them time and opportunity to repent. Those who do not repent are punished. However, this vengeance is not for Allah's own sake, but for the oppressed. Allah seeks justice for those wronged, not for Himself."
  },
  {
    "arabicName": "العفو",
    "name": "El-Afüvv",
    "shortDescription": "Affı ve rahmeti çok olan, bağışlayan.",
    "longDescription": "Hiç bir sorumluluk kalmayacak şekilde günahları affeden demektir. Allah Teâlâ, günahları kökünden kazıyıp tamamen yok eder. Kirâmen kâtibin meleklerinin kayıtlarını siler. Hatırlayıp mahçup olmasınlar diye kullarına işledikleri günahları da unutturur. Bu isimden nasip alan kul, bir taraftan devamlı Allah’tan af diler, diğer taraftan ümitsizliğe kapılmaz. Kullara karşı da çok affedici olur.",
      "shortDescriptionEn": "The Pardoner, full of mercy and forgiveness.",
      "longDescriptionEn": "The One who forgives sins to the point where no responsibility remains. Allah completely removes sins, erasing the records of angels who note them down. He even makes His servants forget their past sins, so they are not ashamed. A person who receives the blessing of this name continues to seek Allah's forgiveness and never loses hope, showing great forgiveness towards others."
  },
  {
    "arabicName": "الرؤوف",
    "name": "Er-Raûf",
    "shortDescription": "Pek acıyan, lütuf ve merhametle pek esirgeyen.",
    "longDescription": "Çok şefkatli ve merhametli demektir. Allah Teâlâ, kullarına karşı ileri derecede merhamet ve şefkat sahibidir. Kullarının sıkıntılarını ortadan kaldırır. Allah kullarına akıl ve iyiyi kötüyü ayırt etme yeteneği vermiştir. Kullarını, işledikleri suçlardan dolayı hemen cezalandırmaz. Onlara hatalarından dönmesi için fırsat tanır. İnanan kullarının kusurlarını bağışlar, iyi amellerine fazlasıyla mükâfât verir.",
      "shortDescriptionEn": "The Most Compassionate, with great mercy and care.",
      "longDescriptionEn": "The One who is extremely compassionate and merciful. Allah has an immense level of mercy and kindness towards His creation. He removes their suffering and grants them the ability to distinguish right from wrong. Allah does not hastily punish for mistakes, but gives time for repentance. He forgives the flaws of His believers and rewards their good deeds abundantly."
  },
  {
    "arabicName": "مالك الملك",
    "name": "Mâlikü’l-Mülk",
    "shortDescription": "Mülkün ebedi sahibi olan.",
    "longDescription": "Mülkün gerçek sâhibi; bütün varlık âleminin tek hâkimi demektir. Allah Teâlâ, bütün kâinatın tek sâhibi ve mâlikidir. Mülkünde istediği gibi tasarruf eder. Dilediğine mülk verir, dilediğine vermez. Dilediğine az verir, dilediğine çok verir. Mutlak hükümranlık O’na aittir. Bu isimden nasip alan kulda mal ve mülkün emânet olduğu şuuru yerleşir. Mal ve mülkü nasıl kullanacağını bilir; israf ve cimrilikten uzak durur. Nimet verene şükrünü tam yapar.",
      "shortDescriptionEn": "The Owner of the Kingdom, the eternal Sovereign.",
      "longDescriptionEn": "The true Owner of all dominion, the sole Ruler of the entire universe. Allah has complete authority over the universe. He gives and takes dominion as He wills, granting some with wealth and others with less, or more, as He deems fit. His sovereignty is absolute. A person who is blessed with this name becomes aware that wealth is a trust from Allah and learns to use it wisely, avoiding wastefulness and greed while expressing gratitude for the blessings received."
  },
  {
    "arabicName": "ذو الجلال و الإكرام",
    "name": "Zü’l- Celal-i ve’l-İkram",
    "shortDescription": "Her türlü büyüklüğün, her türlü keremin sahibi olan.",
    "longDescription": "Ululuk ve ikrâm sahibi demektir. Allah Teâlâ, yaratıkları tarafından yüceltilmeye ve övülmeye lâyık olandır. Kullarından dilediklerine, kendisine samimiyetle kulluk vazifelerini yapmayı sağlayan, mânevî derecelerini yükselten, dünyada ve âhirette onlara bol lütuflarda bulunandır. Ne kadar büyüklük, ululuk, yücelik varsa, hepsi Allah’a mahsustur.",
      "shortDescriptionEn": "The Lord of Glory and Honor.",
      "longDescriptionEn": "The One who possesses all glory and honor. Allah is deserving of all praise and exaltation from His creation. He grants His chosen servants the ability to fulfill their duties to Him with sincerity, elevating their spiritual ranks and showering them with abundant blessings in this world and the Hereafter. All glory, majesty, and honor belong solely to Allah."
  },{
  "arabicName": "المقسط",
  "name": "El-Muksît",
  "shortDescription": "Bütün işleri birbirine uygun ve denk yapan.",
  "longDescription": "Adâlet sahibi; bütün işlerini denk, birbirine uygun ve yerli yerinde yapan demektir. Allah Teâlâ, adâletle hükmedendir. En üstün adâlet ve merhamet sahibidir. Mazlumların haklarını zâlimlerden alandır. Dünyada dost düşman ayırımı yapmadan bütün kullarına rızık verir. Âhirette, dostları, yaptıklarının karşılığını fazlasıyla alacak, düşmanları ise sadece yaptıklarının karşılığı bir cezaya çarptırılacaklardır.",
    "shortDescriptionEn": "The Just, the One who ensures fairness and justice.",
    "longDescriptionEn": "The One who executes His actions with justice, making them fair and appropriate. Allah is the ultimate dispenser of justice, giving the greatest fairness and mercy. He ensures the rights of the oppressed over the oppressors. In this world, He provides sustenance to all, regardless of friend or foe. In the Hereafter, His friends will receive rewards far beyond their deeds, while the enemies will only face the consequences of their actions."
},
  {
    "arabicName": "الجامع",
    "name": "El-Câmî",
    "shortDescription": "İstediğini istediği zaman istediği yerde toplayan.",
    "longDescription": "İstediğini istediği zaman istediği yerde toplayan demektir. Allah Teâlâ, birbirine benzeyen şeyleri ve benzemeyen zıt şeyleri bir araya getirip toplayandır. Kıyâmet günü hesaba çekmek için yaratıkları toplayandır. Bütün iyilikleri, güzellikleri ve övgüleri zâtında toplayandır. Tabiatları zıt birçok unsuru bir araya getirendir. İnsanları birbirlerine sevdirip kalpleri ısındırandır.",
      "shortDescriptionEn": "The Gatherer, the One who unites and brings together.",
      "longDescriptionEn": "The One who gathers whatever He desires, at any time and place. Allah is the One who unites both similar and contrasting things, bringing them together. On the Day of Judgment, He will gather all His creations for judgment. He collects all good qualities, beauties, and praises within Himself. He brings together opposing forces in nature and makes hearts warm towards one another."
  },
  {
    "arabicName": "الغني",
    "name": "El-Ganîyy",
    "shortDescription": "Çok zengin olan.",
    "longDescription": "Çok zengin olan; hiç bir şeye muhtaç olmayan demektir. Allah Teâlâ, her şey kendisine muhtaç olan; kendisi hiç bir şeye muhtaç olmayandır. Zât ve sıfatlarında her türlü ihtiyaçtan uzak olandır. Çok zengindir, hiçbir şeye ihtiyacı yoktur. Ama bütün varlıklar her konuda O’na muhtaçtır.",
      "shortDescriptionEn": "The Self-Sufficient, the One who is free from need.",
      "longDescriptionEn": "The One who is extremely rich and in need of nothing. Allah is the One who has no need of anything, yet everything and everyone is in need of Him. He is free from all needs in His essence and attributes. He is infinitely wealthy and independent, while all of creation is dependent on Him for every aspect of existence."
  },
  {
    "arabicName": "المغني",
    "name": "El-Muğnî",
    "shortDescription": "İstediğini zengin eden.",
    "longDescription": "İstediğini zengin eden demektir. Allah Teâlâ, dilediği kulun her türlü ihtiyacını karşılayandır. Fakir kullarını lütuf ve ihsânıyla zenginleştirir. Kanâat duygusu lütfedip gönül zenginliğine eriştirir. Kulun hal ve davranışlarını rızası yönüne yönlendirerek mânevî bakımdan zenginleştirir.",
      "shortDescriptionEn": "The Enricher, the One who grants wealth.",
      "longDescriptionEn": "The One who enriches whom He wills. Allah is the One who fulfills the needs of His servants, enriching them through His grace and blessings. He grants them contentment, leading them to spiritual wealth and directing their hearts and actions towards righteousness."
  },
  {
    "arabicName": "المانع",
    "name": "El-Mânî",
    "shortDescription": "Bazı şeylerin meydana gelmesine müsaade etmeyen, engelleyen.",
    "longDescription": "Dilemediği şeylerin gerçekleşmesine izin vermeyen; kötü şeylere engel olan demektir. Allah Teâlâ, bazı isteklerin gerçekleşmesine müsaade etmez. Bütün isteklerimiz, Allah’ın dilemesi ve takdiriyle gerçekleşir. O’nun dilemediği bir şey olmaz. Dilediği şey de olur. Allah Teâlâ, sevdiği kullarının bazı kötü isteklerine engel olmak suretiyle onları zarardan korur.",
      "shortDescriptionEn": "The Withholder, the One who prevents.",
      "longDescriptionEn": "The One who does not allow the occurrence of things He does not wish for, preventing harm. Allah does not permit the fulfillment of certain desires and willful actions. All that happens occurs by His will and decree. What He does not wish will not occur, and what He desires will come to pass. He protects His beloved servants by preventing them from harmful desires."
  },
  {
    "arabicName": "الدار",
    "name": "Ed-Dâr",
    "shortDescription": "Elem ve zarar verecek şeyleri yaratan, hüsrana uğratan.",
    "longDescription": "Zarar veren; elem ve zarar verici şeyleri yaratan demektir. Allah Teâlâ, bir kuluna her hangi bir zarar vermeyi dilerse, hiç kimse ona fayda veremez. Fayda vermek istediği kimseye de kimse zarar veremez. “Dârr” ismi, “Nâfi’” ismiyle beraber değerlendirilmelidir.",
      "shortDescriptionEn": "The Creator of Harm, the One who causes distress.",
      "longDescriptionEn": "The One who creates harm and misfortune. Allah, if He wills to cause harm to a servant, no one can offer him benefit. Likewise, if He intends to benefit someone, no harm can befall them. The name ‘Dârr’ must be considered together with ‘Nâfi,’ the Creator of benefit."
  },
  {
    "arabicName": "النافع",
    "name": "En-Nâfi",
    "shortDescription": "Hayır ve menfaat verecek şeyleri yaratan.",
    "longDescription": "Fayda veren; dilediği kuluna hayırlı ve faydalı olanı veren demektir. Allah Teâlâ, zararlı gibi görünen her şeyi sezilmez yollarla faydalı hale getirendir. Çaresizlerin imdadına yetişendir. Kulunu hayra ve iyiliğe yöneltendir. “Nâfi” ismi, “Dârr” ismiyle beraber değerlendirilmelidir.",
      "shortDescriptionEn": "The Benefactor, the One who brings benefit.",
      "longDescriptionEn": "The One who grants what is beneficial and good. Allah is the One who turns what seems harmful into beneficial things through unseen means. He assists the helpless and guides His servants towards good and righteousness. The name ‘Nâfi’ should be considered in conjunction with ‘Dârr,’ the Creator of harm."
  },
  {
  "arabicName": "النور",
  "name": "En-Nûr",
  "shortDescription": "Alemleri nurlandıran.",
  "longDescription": "Nurlandıran, ışık veren, nur kaynağı; âlemleri nurlandıran; istediği simalara, zihinlere ve gönüllere nur yağdıran demektir. Allah Teâlâ, varlığı apaçık olandır. Nuru yaratan, onunla gökleri ve yeri aydınlatandır. Kulunun kalbini, gönlünü îmân nuruyla aydınlatarak hidâyete ermesini ve doğruyu bulmasını sağlayandır.",
    "shortDescriptionEn": "The Light, the One who illuminates the worlds.",
    "longDescriptionEn": "The One who gives light, the source of light; the One who illuminates the worlds and showers light on the faces, minds, and hearts of whomever He wills. Allah is the One whose existence is manifest. He created light and with it, He illuminates the heavens and the earth. He enlightens the hearts and souls of His servants with the light of faith, guiding them towards righteousness."
},
  {
    "arabicName": "الهادي",
    "name": "El-Hâdî",
    "shortDescription": "Hidayete ve doğru yola erdiren.",
    "longDescription": "Hidâyeti yaratan; istediği kulunu muradına erdiren, hayırlı yollara muvaffak kılan demektir. Allah Teâlâ, inanacak kalplerde hidâyeti yaratandır. Ebedî mutluluğu sağlayacak doğru yolu gösteren ve doğru yola ulaştırandır. Yolunu şaşırmışlara rehberlik edendir.",
      "shortDescriptionEn": "The Guide, the One who leads to guidance.",
      "longDescriptionEn": "The One who creates guidance; the One who leads His servants to the paths of goodness and success. Allah creates guidance in the hearts of those who believe. He shows the path that leads to eternal happiness and guides those lost to the right path."
  },
  {
    "arabicName": "البديع",
    "name": "El-Bedî",
    "shortDescription": "Örneksiz, misilsiz, hayret verici nice âlemler icad eden.",
    "longDescription": "Varlıkları, eşi, benzeri ve örneği olmaksızın, sanatkârane bir şekilde yaratan demektir. Allah Teâlâ, her şeyi, bir numûnesi, benzeri olmaksızın yaratandır. Bu yaratma da eşsiz ve benzersiz bir yaratmadır. Yani akıllara durgunluk verecek derecede kusursuz ve mükemmel yaratmadır. Allah, zâtında, sıfatlarında ve fiillerinde benzeri görülmeyendir.",
      "shortDescriptionEn": "The Incomparable Originator, the One who creates without a parallel.",
      "longDescriptionEn": "The One who creates things without a likeness or example, in a masterful and unique way. Allah is the One who creates everything without any prototype or equivalent. His creation is unparalleled, perfect, and flawless, astonishing the minds with its perfection. There is no equivalent to Him in His essence, attributes, or actions."
  },
  {
    "arabicName": "الباقي",
    "name": "El-Bâki",
    "shortDescription": "Varlığının sonu bulunmayan, ebedi olan.",
    "longDescription": "Ebedî olan; varlığının sonu olmayan demektir. Allah Teâlâ, varlığı devamlı olandır. Varlığının bir başlangıcı olmadığı gibi bir sonu da yoktur. Zâtı da, sıfatları da, fiilleri de bâkîdir, ebedîdir, devamlıdır. Mü’min de her hangi bir işi Allah rızası için yapmışsa, o fiil de ebedîlik kazanır. Yani kul, öbür âlemde mükâfâtını alır.",
      "shortDescriptionEn": "The Everlasting, the One whose existence is infinite.",
      "longDescriptionEn": "The One whose existence has no end, the eternal One. Allah is the One whose existence is continuous with no beginning or end. His essence, attributes, and actions are everlasting, eternal, and constant. A believer who performs an action for the sake of Allah gains eternity in that deed, receiving its reward in the afterlife."
  },
  {
    "arabicName": "الوارث",
    "name": "El-Vâris",
    "shortDescription": "Servetlerin gerçek sahibi olan.",
    "longDescription": "Varlığının sonu olmayan demektir. Allah Teâlâ, yaratılmış bütün varlıkları yok ettikten sonra bâkî kalan, mülkün gerçek sahibidir. Mülkü dilediğinden alır, dilediğine verir. Dünyada bulunan herkes ve evrende bulunan her şey fânîdir, geçicidir. İnsanlar ölümlü oldukları için sahip oldukları mal, mülk, servet de geçicidir.",
      "shortDescriptionEn": "The Inheritor, the One who is the true owner of all.",
      "longDescriptionEn": "The One whose existence has no end. Allah is the true owner of all possessions. After the annihilation of all created beings, He remains as the everlasting inheritor. He gives and takes His dominion as He wills. All that exists in the world is transient and temporary, as humans and everything in the universe are finite and perishable."
  },
  {
    "arabicName": "الرشيد",
    "name": "Er-Reşid",
    "shortDescription": "Bütün işleri ezeli takdirine uygun bir nizam ve hikmet üzere sonuna ulaştıran.",
    "longDescription": "İrşad eden; doğru yolu gösteren demektir. Allah Teâlâ, bütün işleri isabetli olan ve hedefine ulaşandır. Her şeyi ezelî takdirine göre yürüten, bir nizam ve hikmet üzere sonuna ulaştırandır. Lüzumsuz, faydasız, boş iş yapmayandır. Fiilleri dâimâ yerinde olandır. Devamlı olarak hakka isabet edendir. Hiç kimsenin yol göstermesine muhtaç olmayandır.",
      "shortDescriptionEn": "The Guide to the Right Path, the One who brings everything to its correct end.",
      "longDescriptionEn": "The One who guides to the right path and completes everything with wisdom and perfection. Allah leads all things to their destined end with precision and wisdom, in accordance with His eternal decree. He never engages in futile actions and all His actions are perfectly timed and placed. He is constantly in alignment with truth and does not require any guidance from others."
  },
  {
    "arabicName": "الصبور",
    "name": "Es-Sabûr",
    "shortDescription": "Çok sabırlı olan.",
    "longDescription": "Çok sabırlı demektir. Allah Teâlâ, günahkârları cezalandırma konusunda acele etmeyip lütfuyla bağışlayan ve erteleyendir. Günahkârlara mühlet tanır. Tövbe kapısını ölünceye kadar açık tutar. Kullarının af ve bağışlama dilemeleri için onlara fırsatlar tanır. Bu isimden nasip alan kul, ibâdetleri yapmada, haramlardan kaçınmada ve her türlü felâket karşısında sabırlı olur.",
      "shortDescriptionEn": "The Most Patient, the One who is infinitely patient.",
      "longDescriptionEn": "The One who is extremely patient. Allah does not hasten in punishing sinners, instead He delays and forgives them by His grace. He gives wrongdoers time to repent and keeps the door of repentance open until their death. He provides many opportunities for His servants to seek forgiveness. A servant who attains this attribute becomes patient in worship, avoids sin, and remains patient in the face of all trials and tribulations."
  }
]
